{"data":{"allAirtable":{"edges":[{"node":{"data":{"title":"Frokost","userIds":null,"email":null,"description":"Frokost","type":"other","start":"07:00","end":"09:00","date":"21","duration":null,"room":null,"speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null}}},{"node":{"data":{"title":"How to write code worth reading","userIds":"Sten Christoffer Eliesen","email":"christoffer.eliesen@knowit.no","description":"Regardless of skill level, some programmers write code that is performant, bug free and works great, but is very difficult to read and understand, and thus difficult to maintain. So in this talk I would like to share my experience and explain how you can write code that is easier to maintain","type":"talk","start":"14:30","end":"15:00","date":"19","duration":30,"room":"Grazia","speaker_bio":"Christoffer er en engasjert utvikler som brenner for IT. Han er nysgjerrig og glad i å lære nye ting. Han stiller høye krav til seg selv og det han leverer, men er pragmatisk når det trengs. Hans interesse for IT spenner seg hele veien fra operativsystem til brukergrensesnitt, og han er derfor en naturlig fullstack og \"devops\" utvikler. I disse tider er det frontend som er i vinden og Christoffers hjerte følger etter. React og Node er spennende teknologier som passer han midt i blinken. Over ti års erfaring har gjort han trygg i rollen som konsulent. Han er en dyp tenker og liker å løse vanskelige problemer.","speaker_favourites":null,"speaker_recreation":null}}},{"node":{"data":{"title":"Utviklingsmijlø i skyen","userIds":"Øyvind Marthinsen","email":"oma@knowit.no","description":"Kjøring av applikasjoner i skyen er nå blitt den nye normen, men fortsatt sitter vi å utvikler applikasjonene på personlige maskiner. I dette foredraget vil jeg gå igjennom min ferd i å sette opp og bruke et utviklingsmiljø i skyen.\n\nJeg kommer til å gå igjennom motivasjonen for dette, fortelle om noen mislykkede fremgangsmåter og gi en oversikt over oppsettet jeg endte på.","type":"talk","start":"14:30","end":"15:00","date":"19","duration":30,"room":"Harmoni","speaker_bio":"Øyvind er en engasjert utvikler som brenner for utvikling av moderne web applikasjoner. Han trives like godt på klientsiden som på serversiden, og har gjennom deltakelse i flere større og mindre prosjekter tilegnet seg mye kunnskap om smidige metoder og prosjektstyring. Øyvind er en fullstack utvikler, men har de siste årene jobbet mest med frontendteknologier som JavaScript, HTML5 og CSS3. I tillegg har han stor interesse for mobile plattformer og responsivt design. Gjennom flere år som konsulent har han fått kunnskap om og erfaring med hele systemutviklingsprosessen, fra planlegging og design til testing og produksjonssetting. Øyvind er flink til å se kundens behov og setter alltid brukeren i fokus under utvikling av løsninger. Han er også en pragmatisk person som liker å utfordre seg selv på å lage enkle løsninger for komplekse problemer.","speaker_favourites":null,"speaker_recreation":null}}},{"node":{"data":{"title":"How can statistics about Oslo municipality be more fun with D3.js","userIds":"Aulon Mujaj","email":"aulon.mujaj@knowit.no","description":"La meg vise deg historien hvordan vi greide å gi Oslo kommune sine faktaark og statistikksider om bydelene og delbydelene en makeover til noe fint og lettleselig statistikk ved bruk av grafbiblioteket D3 og javascript rammeverket VueJS! Ikke mer titalls timer arbeid om å manuelt lage grafer i excel, når d3 og vue kan gjøre dette automatisk for deg!","type":"talk","start":"13:00","end":"13:30","date":"19","duration":30,"room":"D","speaker_bio":"Begynte hos knowit i 2017 som fulltidsansatt, jobber for Oslo kommune - Origo, som frontendutvikler. Spesielisert i VueJS men kan også litt reactjs her og der.","speaker_favourites":"burger;elektronika;kosovo;serie: lost - film: brokeback mountain; Under brugata","speaker_recreation":"Aulon liker å spille squash på fritiden, se på alt for mange tv-serier i uka og generelt bare ta ei litta øl her og der."}}},{"node":{"data":{"title":"My Life as a Cyborg","userIds":"Michael Johansen","email":"michael.johansen@knowit.no","description":"Are you doing well as an adult? All around you are scales that must not tip too much to one end or the other. This talk will take a deep dive into how one person tackles the balances of life, and indexes life to the point of becoming a cyborg.","type":"talk","start":"14:30","end":"15:00","date":"19","duration":30,"room":"B","speaker_bio":"Michaels kjernekompetanse innen programvareutvikling er JavaScript og Java. Innenfor JavaScript er fokuset hans på NodeJS, React, Redux, CreateJS, Leaflet, D3, nettleser-APIer, og nettleserutvidelser. På Java-fronten er fokuset hans på API-baserte applikasjoner med MySQL-databaser. Han foretrekker skyløsninger, og har erfaring med provisjonering av tjenere som er fullstendig selvforsynt, der både applikasjoner, verktøy, sikkerhetsrutiner og backup er scriptet.\n\nForutenom programvareutvikling har Michael bygget seg opp ekspertise innenfor både forretningsutvikling, startups, og strategisk ledelse. Dette gjør ham til et godt tilskudd til ethvert utviklingsteam. Etter å ha laget en nettleserutvidelse i JavaScript som er brukt av 1000 studenter på NTNU fant han en lidenskap for webteknologi og brukeropplevelser. Han opparbeidet seg ferdigheter innen oppstartsbedrifter og forretningsutvikling ved å bygge opp en startup. Ett år som styremedlem i NTNU's Board of Directors, og to år som leder av linjeforeningen Online, la til strategisk ledelse i hans miks av ferdigheter. Han trives godt med både individuelt arbeid og med teamarbeid. De som kjenner ham godt beskrive ham som systematisk og behagelig å jobbe med.\n\nMichael holder foredrag både internt og på konferanser. Hans favoritteamer er personlig digital sikkerhet og presentasjonsteknikk. Hans populære sikkerhetsforedrag har blitt holdt over 20 ganger. Se seksjonen \"Presentasjoner\".","speaker_favourites":null,"speaker_recreation":null}}},{"node":{"data":{"title":"Solflekktelling med Java i baksetet","userIds":"Jan Alvestad","email":"jan.alvestad@knowit.no","description":"Innføring i metode som benyttes for å forenkle telling og klassifisering av solflekker. Beskrivelse av hvordan en kan benytte Java for å lage et bilde med elementer fra flere andre bilder.","type":"talk","start":"14:30","end":"14:45","date":"19","duration":15,"room":"C","speaker_bio":"Lang og allsidig erfaring som objektorientert systemutvikler både på Java og .Net. Fokus på å utvikle det som gir størst nytteverdi for kunden og på å lage kode som lett kan vedlikeholdes av andre utviklere. Har arbeidet mest innen petroleumsrettet virksomhet. I løpet av de siste årene har han opparbeidet seg erfaring innen testautomatisering. Jan trives godt både med selvstendig arbeid og i grupper, gjerne der agile arbeidsmetoder blir benyttet. Han samarbeider og kommuniserer godt med andre utviklere, testere og ledere.","speaker_favourites":null,"speaker_recreation":null}}},{"node":{"data":{"title":null,"userIds":"Arne Løvold","email":"arne.lovold@knowit.no","description":null,"type":"talk","start":"13:00","end":"13:30","date":"19","duration":30,"room":"B","speaker_bio":"                                   - Marc Andreessen","speaker_favourites":null,"speaker_recreation":null}}},{"node":{"data":{"title":"Fly til Oslo","userIds":null,"email":null,"description":"Fly fra Praha til OSL (charter)","type":"other","start":"17:00","end":null,"date":"21","duration":null,"room":null,"speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null}}},{"node":{"data":{"title":"Hvordan redder Knowit verden? Om knowits bidrag til bærekraft og bistand","userIds":"Klaus Stafto","email":"klaus.stafto@knowit.no","description":"Hva gjør vi i Knowit innen bærekraft og bistand?\nInnen klimavennlig transport bidrar vi både som utviklingsleverandør og investor til spennende startups. Dessuten hjelper vi Oslo kommune med innovative ideer til avfallshåndteringen. På kundelisten ellers finnes blant annet Norad og Miljødirektoratet. Dessuten skjer det ting internt i konsernet.\nKom og skaff deg snakkepunkter til neste gang du skal fortelle ukjente hva Knowit gjør (i/for verden). Eller dersom du vurderer en annen type mening enn det kanskje er i prosjektet/produktet på jobber med nå.","type":"keynote","start":"09:00","end":"09:30","date":"20","duration":30,"room":"BCD","speaker_bio":"Klaus leder virksomheten i Trondheim og har jobbet i Knowit (og et oppkjøpt selskap) i periodene 2004-2011, 2013-2014 og fra 2017.\nKlaus er engasjert og samvittighetsfull, og legger sin ære i å lage solide tekniske løsninger. Han har en sympatisk og behagelig fremtoning, og er flink til å hjelpe og forbedre sine prosjektkolleger. Klaus deltar i kundeprosjekter og har ansvar for salg og rekruttering for trondheimskontoret.\n\nHan har bred erfaring fra IT-konsulentbransjen i roller som prosjektleder, arkitekt, utreder/rådgiver, gruppeleder og utvikler. Han kan ta ansvar for planlegging, gjennomføring, kontrollering og rapportering av aktiviteter og ressurser, samt initiering og avslutning av prosjekter. Metoder og prosessmodeller tilpasses gjerne til kunden og prosjektet.\n\nKlaus har erfaring fra behovskartlegging for å identifisere og detaljere krav til funksjonalitet, datakvalitet og andre ikke-funksjonelle krav. Han kan bistå ved teknisk relaterte valgprosjekter (arkitektur, teknologi, produkt, leverandør) og estimering av større endringsprosjekter. Klaus kan også gi råd før/under/etter utviklingsprosjekter for å kvalitetssikre prosesser, programkode og leveranser.","speaker_favourites":null,"speaker_recreation":null}}},{"node":{"data":{"title":"Hyperfluid Edge computing platform","userIds":"Per Buer","email":"per.buer@knowit.no","description":"Hailstorm er et prosjekt for å kombinerte smart bruk av Webassembly, WASI og service discovery til å tilby en slags liten ec2 i en liten eske. Målet er at et nettverk, f.eks. om bord i en buss, skal kunne konsumere compute-ressurser på en enkel og trygg måte.\n\nDu skal kunne pakke en backend inn i en klient, f.eks. i en app eller mikrokontroller-enhet. Når app'en så kommer seg på nett så vil den søke seg frem til lokale dataressurser og til kunne konsumere disse for å tilby nye og innovative tjenester.","type":"talk","start":"15:15","end":"15:45","date":"19","duration":30,"room":"D","speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null}}},{"node":{"data":{"title":"Fritid","userIds":null,"email":null,"description":"Fritid","type":"other","start":"16:30","end":"17:30","date":"19","duration":null,"room":null,"speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null}}},{"node":{"data":{"title":"Spring Boot og GraphQL","userIds":"John-Olav Storvold","email":"john-olav.storvold@knowit.no","description":null,"type":"talk","start":"13:45","end":"14:15","date":"19","duration":30,"room":"Grazia","speaker_bio":"John-Olav er en løsningsorientert og faglig nysgjerrig fullstack-utvikler som har bakgrunn i veletablerte teknologier og som også trives med å jobbe med det nyeste innen frontendutvikling. Han er lærevillig og tar stor yrkesstolthet i den jobben han utfører både i og utenfor arbeidstiden.\n\nJohn-Olav har erfaring med å jobbe tett med kundens forretningsside for å forstå deres behov og omsette dem i funksjonalitet. Han er en tålmodig og kommunikativ utvikler som evner å formidle faget sitt på en forståelig måte. Som formidler er han også en populær workshop-arrangør, og holder workshops i programmeringsspråket Rust på store norske utviklerkonferanser.","speaker_favourites":null,"speaker_recreation":null}}},{"node":{"data":{"title":"Middag for Maitrea","userIds":null,"email":null,"description":"Middag for de som skal spise på Maitrea","type":"other","start":"18:30","end":null,"date":"20","duration":null,"room":null,"speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null}}},{"node":{"data":{"title":"Graph først!","userIds":"Audun Hallan","email":"audun.halland@knowit.no","description":"\nEt lite dykk i hvordan et GraphQL-skjema kan fungere som et nyttig modelleringsverktøy tidlig i utviklingsfasen, hvordan det kan skaleres, og hvorfor backendutviklere også bør ha et forhold til det.","type":"talk","start":"15:30","end":"15:45","date":"19","duration":15,"room":"D","speaker_bio":"Audun har bakgrunn fra Opera Software og Nokia, og startet i Knowit i april 2017.\r\n\r\nAudun har drevet med mobilutvikling i 10 år, og er vant med å levere på de hardeste kvalitetskrav, i det globale markedet, med nådeløs konkurranse fra aktører som Google og Apple.","speaker_favourites":null,"speaker_recreation":null}}},{"node":{"data":{"title":"Open Space","userIds":null,"email":null,"description":"Open Space","type":"talk","start":"16:00","end":"16:30","date":"19","duration":30,"room":"C","speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null}}},{"node":{"data":{"title":"Presentasjon X","userIds":"Marit Hellestø","email":"marit.hellesto@knowit.no","description":"Project X, et prosjekt som var både ambisiøst, brukte bleeding edge teknologier og var banebrytende innen sitt marked, så mye at man av konkurransehensyn ikke kunne kalle prosjektet noe mer beskrivende. \n\nDenne presentasjonen tar for seg de erfaringene man fikk i løpet av en 3årsperiode, fra oppstart av prosjektet til den største leveransen i prosjektet. Og det denne tiden inneholdt av oppturer og nedturer. ","type":"talk","start":"15:15","end":"15:45","date":"19","duration":30,"room":"B","speaker_bio":"Marit har jobbet i Knowit siden høsten 2015. Hun har en Mastergrad i Informatikk, med fordypning innenfor Algoritmer. Hvor fokuset har vært på eksponentielle algoritmer.\r\n\r\nI Knowit jobber hun som fullstack utvikler. Da med mest fokus på .NET teknologier i backend, og Angular/React i frontend. Tidligere har hun også jobbet mye med mobilutvikling, spesielt innen Android utvikling, men også med iOS og kryssplatformen Xamarin. ","speaker_favourites":null,"speaker_recreation":null}}},{"node":{"data":{"title":"Knowits selvbetjente dataplattform","userIds":"Jan Henrik Gundelsby","email":"jhg@knowit.no","description":null,"type":"keynote","start":"11:15","end":"11:45","date":"19","duration":15,"room":"BCD","speaker_bio":"Jan Henrik har 20 års erfaring som utvikler, arkitekt og teknologileder i store prosjekter og programmer. Han har jobbet med store strategiske satsninger på digitalt førstevalg, og har vært sentral i å bygge DevOps-kultur og mikrotjenestearkitektur hos store virksomheter. Jobbet mye med digital transformasjon i alle deler av virksomheter. Jobber tett med forskningsmiljøer rundt autonome team og digitale plattformer.\n\nJan Henrik er CTO i Knowit Objectnet, og har et spesielt ansvar for kompetanseutvikling og riktig bruk av teknologi på tvers av prosjekter. \n\nHan holder jevnlig foredrag på konferanser og har kompetanse som spenner over særdeles mange fagområder. For liste over foredrag se http://gundelsby.com. Spesialisert innen integrasjon i store virksomheter (spesielt mikrotjenester-arkitektur), problemløsning, team- og teknisk ledelse og DevOps. ","speaker_favourites":null,"speaker_recreation":null}}},{"node":{"data":{"title":"Fingermat ","userIds":null,"email":null,"description":"Fingermat og 1-2 enheter øl inkl alkofritt","type":"other","start":"22:00","end":null,"date":"18","duration":null,"room":null,"speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null}}},{"node":{"data":{"title":"Brukervennelige APIer","userIds":"Anders R. Dahlen","email":"anders.dahlen@gmail.com","description":null,"type":"talk","start":"13:45","end":"14:15","date":"19","duration":30,"room":"Grazia","speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null}}},{"node":{"data":{"title":"Hvordan sikre REST-API med OpenID Connect/OAuth2","userIds":"Yngvar Kristiansen","email":"yngvar.kristiansen@knowit.no","description":"Presentasjon viser hvordan vi enkelt kan sikre et REST API med OpenID Connect (OIDC). OIDC er en industristandard for autorisering, og nyttig å kunne dersom man jobber med APIer eller arkitektur.\n\nVi gjennomgår hvordan man setter opp et sikret API, hvordan man aksesserer API-et med en token, samtidig som vi tar for oss ulike sikringsmetoder i Oauth2 (flows). Kode vil bli vist i Java og Spring Boot, mens Keyclok brukes som OIDC-provider. Hvis det blir tid ser vi hvordan vi kan konsumere API-et fra en frontend.","type":"talk","start":"14:45","end":"15:00","date":"19","duration":15,"room":"C","speaker_bio":"Yngvar er utvikler og har jobbet med back-end, front-end, drift og programvarearkitektur. Konsulenten har erfaring fra komplekse, forretningskritiske applikasjoner, behandling av store datamengder, og web-applikasjoner. Han har erfaring med flere deler av FSUM: Kravhåndtering, konstruksjon, test og estimering.\r\n\r\nYngvar har personlig interesse for devops, kodekvalitet, testing, arkitektur og brukervennlighet, og fokuserer alltid på å gjøre ting riktig framfor å ta snarveier. Samtidig sikter han på å løse forretningsbehov, og er løsningsorientert i arbeidet sitt.\r\n\r\nSmidig teamarbeid og diskusjoner er noe Yngvar er vant med og trives med, og han ses på som en lagspiller. Han jobber likevel godt selvstendig, er systematisk og en pådriver for progresjon.\r\n","speaker_favourites":null,"speaker_recreation":null}}},{"node":{"data":{"title":"Pause","userIds":null,"email":null,"description":"Pause","type":"other","start":"10:15","end":"10:30","date":"20","duration":null,"room":null,"speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null}}},{"node":{"data":{"title":"Karakteristika ved Autonome team – funn fra Spotify","userIds":"Dr. Nils Brede Moe, SINTEF","email":null,"description":"Gjennom vår forskning i Spotify har vi funnet hva som kjennetegner de autonome team som ser ut til å fungere godt og de som har utfordringer. \n\nVi har også sett på hvordan teamene samarbeider innen en «Tribe» og på tvers av hele organisasjonen, og hva ledere må gjøre for å tilrettelegge for autonomi.  Hvordan gode team håndterer avhengigheter til andre team overrasket oss.","type":"keynote","start":"11:30","end":"12:00","date":"20","duration":30,"room":"BCD","speaker_bio":"Nils er forskningsleder ved SINTEF Digital og forsker ved Blekinge Tekniske Høgskole (BTH).\n\nVi kjenner han fra Knowits forskningssamarbeid, dessuten bidrar han til Knowit Academy med en sesjon på utviklingsprosesser.\n\nHan forsker ellers på autonome team, sourcing, innovasjon, agile praksiser, virtuelle team i mer enn 15 år. Studier i Norden, Øst-Europa, USA, Kina og Australia\n","speaker_favourites":null,"speaker_recreation":null}}},{"node":{"data":{"title":"Hvorfor er alle server-operativsystemene vi bruker usikre og hva kan vi gjøre med det?","userIds":"Per Buer","email":"per.buer@knowit.no","description":"Dagens operativsystem er i all hovedsak like og de forsøker å alle å løse det jeg mener er irrellevante problemer.  Moderne operativsystemer er alle designet for en annen tid og en annen bruk. \nHovedproblemet er at dagens operativsystem setter få begrensninger på hva applikasjonene kan gjøre. De står fritt til å endre oppførsel på hele system.\n\nJeg forslår et alternativt operativsystem-design og et par andre løsninger som kan være med på å endre situasjonen.","type":"talk","start":"13:15","end":"13:30","date":"19","duration":15,"room":"C","speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null}}},{"node":{"data":{"title":"Folkeregisteret","userIds":"Rune Myrdal","email":"rmy@knowit.no","description":null,"type":"keynote","start":"10:30","end":"11:15","date":"20","duration":45,"room":"BCD","speaker_bio":"Rune er en engasjert systemutvikler som alltid søker løsninger som er best for kunden, prosjektet og systemet som skal leveres. Felles for de siste prosjektene Rune har jobbet i, er at han har vært med å utforme/videreutvikle prosesser rundt utvikling og testing, rapportering, kvalitetssikring, versjonskontroll av kode samt koordinert endringskrav. I tillegg til utvikling (for det meste i Java) har han jobbet med å utforme den totale arkitekturen for de nye systemene. Dette innebærer både å få best mulig utnyttelse internt i et system samt integrasjon med andre systemer. \r\nRune har gjennom ulike roller som systemutvikler hos forskjellige kunder opparbeidet seg bred erfaring rundt hvilke tekniske løsninger som fungerer og hvilke fallgruver som må unngås. \r\n\r\nKonsulenten liker å jobbe med arkitektur og har derfor gjennomført TOGAF 9 sertifisering (level 1 og 2).\r\n\r\nRune har gode norskkunnskaper, både skriftlig og muntlig.","speaker_favourites":null,"speaker_recreation":null}}},{"node":{"data":{"title":"Frokost","userIds":null,"email":null,"description":"Frokost","type":"other","start":"07:00","end":"09:00","date":"20","duration":null,"room":null,"speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null}}},{"node":{"data":{"title":"Pause","userIds":null,"email":null,"description":"Pause","type":"other","start":"13:30","end":"13:45","date":"19","duration":null,"room":null,"speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null}}},{"node":{"data":{"title":"A Paranoids Guide to Trusting Open Source","userIds":"Rickard","email":null,"description":null,"type":"keynote","start":"09:30","end":"10:00","date":"19","duration":30,"room":"BCD","speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null}}},{"node":{"data":{"title":"Etisk AI - EUs etiske retningslinjer","userIds":"Torbjørn Moen","email":"torbjorn.moen@knowit.no","description":"En gjennomgang av EUs etiske retningslinjer for de som lager og tar i bruk AI","type":"talk","start":"13:15","end":"13:30","date":"19","duration":15,"room":"Idea","speaker_bio":"Torbjørn Moen har lang og bred erfaring som ansatt i offentlig sektor der han blant annet har jobbet som utviklingsleder, som produkteier og som prosjektleder for mange innovasjons- og utviklingsprosjekter. Han har vært med på reisen fra gammeldagse fossefallprosjekter til smidig produktutvikling i autonome team og har sett hva det kan gjøre med innovasjonstakten. Torbjørn har også en karriere som skjønnlitterær forfatter og har gitt ut nesten 20 romaner beregnet på barn og unge.","speaker_favourites":null,"speaker_recreation":null}}},{"node":{"data":{"title":"Første fly til Praha (SAS)","userIds":null,"email":null,"description":"Første fly til praha","type":"other","start":"19:00","end":"22:00","date":"18","duration":null,"room":null,"speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null}}},{"node":{"data":{"title":"Burde du utvikle apper med React Native","userIds":"Patrick Monslaup","email":"patrick.monslaup@knowit.no","description":"Å utvikle apper til iOS og Android har lenge vært en utfordring, da du enten kan utvikle det hver for seg til hvert av operativsystemene, eller bruke mer eller mindre dårlige hybrid-løsninger. React Native forsøker å løse problemet ved at koden transformeres til native - men fungerer dette godt nok, og hva er smertepunktene?\n\nI denne ikke-tekniske erfaringsbaserte talken vil vi gjennomgå hva som fungerer og komme med anbefalinger til når du bør bruke React Native vs. andre måter å utvikle apper.","type":"talk","start":"14:30","end":"14:45","date":"19","duration":15,"room":"D","speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null}}},{"node":{"data":{"title":"Open Space","userIds":null,"email":null,"description":"Open Space","type":"talk","start":"14:30","end":"15:00","date":"19","duration":30,"room":"Idea","speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null}}},{"node":{"data":{"title":"Internmøte","userIds":"Ledelsen","email":null,"description":"Internmøte","type":"keynote","start":"09:00","end":"09:30","date":"19","duration":30,"room":"BCD","speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null}}},{"node":{"data":{"title":"Fordeling til restauranter","userIds":null,"email":null,"description":"Opplegg for fordeling til restauranter","type":"other","start":"18:30","end":null,"date":"19","duration":null,"room":"BCD","speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null}}},{"node":{"data":{"title":"Peer Reviews I've Loved before","userIds":"Tom Fagerland","email":"tom.fagerland@knowit.no","description":"Hvordan takle PR kommentarer med eksempler, ikke alle virkelige. Forhåpentligvis vil dette også bidra til at folk skriver bedre kommentarer også. Morsomt, men med en seriøs kjerne. Slides på engelsk, siden jeg skriver bedre på engelsk og håper å utvide foredraget til en litt mer \"how to work together without killing each other\"-style foredrag som antageligvis blir litt lenger.","type":"talk","start":"15:15","end":"15:30","date":"19","duration":15,"room":"Grazia","speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null}}},{"node":{"data":{"title":"Et halvt år i en Principal Engineers liv","userIds":"Rune Storløpa","email":"rst@knowit.no","description":"Jeg har vært ute på oppdrag det siste halve året, og forsøkt å fortelle en kunde hvorfor utviklerne virker å være så ineffektive og hva de kan gjøre med det... Det fungerte sånn passe, så det tenkte jeg å fortelle om...","type":"talk","start":"15:30","end":"15:45","date":"19","duration":15,"room":"Grazia","speaker_bio":"Erfaren Principal Engineer, virksomhetsarkitekt, teknisk arkitekt / løsningsansvarlig, som aldri blir enig med seg selv om det er morsomst å lage gode løsninger eller å diskutere med beslutningstakere for å få de til å velge gode løsninger. Gjør derfor gjerne begge deler så langt tiden strekker til.\n\nRune har kjernekompetanse innenfor analyse, arkitektur og utvikling primært på Open Source-plattform i større enterprise systemer. Interessene har i senere tid også dreid i retning av å inkludere hele livsløpet til løsninger, og hvordan driftbarhet, videreutvikling, organisering og forvaltning av løsninger må tas inn i utviklingsprosessen for å kunne levere best mulige tjenester. Dette innebærer både rene tekniske aspekter, populært kalt DevOps. Men også mer organisatoriske, hvordan nye tekniske løsninger og forvaltning av disse får innvirkning på både budsjettprosesser og eksisterende arbeidsoppgaver for å kunne realisere gevinster i størst mulig grad.\n\nI rollen som Principal Engineer i Knowit Objectnet bidrar han også med rekruttering, kunnskapsutveksling, sikring av oppdrag etc. Han har også ledererfaring som teamleder og prosjektleder.","speaker_favourites":null,"speaker_recreation":null}}},{"node":{"data":{"title":"Objectnet 1999-2019","userIds":"Lars Ivar Næss","email":"lin@knowit.no","description":"Et historisk og forhåpentligvis underholdende tilbakeblikk på 20 års Objectnet-historie","type":"keynote","start":"17:30","end":"18:30","date":"19","duration":60,"room":"BCD","speaker_bio":"Lars Ivar Næss har jobbet i Knowit Objectnet (inkl. datterselskap Unified Consulting) som avdelingsleder siden 2003, med ansvar for ca. 40 konsulenter. Stillingen omfatter personalansvar, budsjettansvar, prosjektansvar, kundeansvar, salg av konsulenter, vurdering av nye muligheter, sikring av oppdrag etc. Han er sertifisert innenfor prosjektledelse (PMP / PMI-ACP) og test (ISTQB), og har bakgrunn som utvikler med nøkkelkompetanse innenfor databasesystemer, datamodellering, objektorientert modellering / utvikling samt systemutviklingsprosesser.\r\nSiden 2008 har han vært involvert i flere prosjekter for Oslo kommune som prosjektleder, kundeansvarlig og rådgiver - bl.a. ITAS (Interaktive Tjenester) og PFF (Program for fellesfunksjonalitet). De senere årene har han også vært involvert mot NSB, Kommuneforlaget, Statens Vegvesen, Statistisk Sentralbyrå.","speaker_favourites":null,"speaker_recreation":null}}},{"node":{"data":{"title":"Masteroppgave - Arkitektur for nye applikasjoner og tjenester i smarte byer, nabolag og hjem","userIds":"Petter Rostrup","email":"petter.rostrup@knowit.no","description":"Presentasjon om nøkkelpunktene fra masteroppgaven med tittel: \"A Distributed-to-Centralized Architectural Model for Smart City Applications and Services through Container Orchestration\". Den går gjennom behovene for utviklingen av nye applikasjoner og tjenester til bruk i smarte byer, nabolag og hjem. Fokuset ligger på hvordan noen av de voksende utfordringene i smarte byer kan håndteres/reduseres fra et utviklingsperspektiv.","type":"talk","start":"13:00","end":"13:30","date":"19","duration":30,"room":"Grazia","speaker_bio":"Petter er systemkonsulent / utvikler med Master i Informatikk fra NTNU. Han har spesialisering innen programvaresystemer, og er en engasjert og sosial person som er glad i nye utfordringer. Han trives godt som fullstack-utvikler der det ikke trenger å være noen begrensninger i typen arbeidsoppgaver. Han har erfaring med mange teknologier, og har utviklet sluttprodukter til varierende formål. Han synes det er spennende å jobbe med  funksjonalitet fra konsept til produksjonsklar kode. Petter er faglig nysgjerrig på nye teknologier og rammeverk,","speaker_favourites":null,"speaker_recreation":null}}},{"node":{"data":{"title":"Prosessering av industrielle IoT datastrømmer","userIds":"Christian Egeberg","email":"ceg@knowit.no","description":"Om mellomlagring og bearbeiding av sensordata for å kunne beregne ytelsesindikatorer, og detektere uregelmessigheter i datastrømmer fra industrielt utstyr, som for eksempel pumper, aggregater og skipsmotorer.","type":"talk","start":"13:00","end":"13:30","date":"19","duration":30,"room":"Harmoni","speaker_bio":"Christian har kjernekompetanse innenfor .Net teknologi, skyarkitektur, objektorientert systemutvikling, smidige metoder, mobile enheter, Azure, web 2.0, databaser, dataintegrasjon og SQL optimalisering. Han har lang erfaring fra utvikling av skytjenester, web applikasjoner, mobile apps, trelags applikasjoner, visualisering av data, kartintegrasjon, og SMS / MMS tjenester.\r\n\r\nChristian har gode analytiske evner, kan arbeide selvstendig, er sosial og utadvendt, og bidrar med kompetanse som spenner over mange fagområder. Han elsker for øvrig å fikle med dingser som HoloLens, Oculus Rift, Oculus Touch, Leap Motion, og kroppsbårne, nettilkoblede eller mobile enheter, pluss at han er en ivrig fotograf.\r\n\r\nChristian fullførte i 2018 og 2016 Microsoft Lead Enterprise Architect Program, bestående av henholdsvis 5 dager på Microsoft Campus i Redmond Washington, og 3 dager på Microsoft Campus, etterfulgt av 5 dager hos Microsoft Norge. I tiden før Knowit jobbet Christian med språk som C, C++, Visual Basic og T-SQL.","speaker_favourites":null,"speaker_recreation":null}}},{"node":{"data":{"title":"Borre hull i autonome siloer","userIds":"Steinar Hansen","email":"sbh@knowit.no","description":"Etter å ha observert Origo på utsiden og hørt litt om erfaringer i fra andre prosjekter; Selv om en sitter i et autonomt team og i teorien kan gjøre som en selv vil, så er det fremdeles behov for samhandling og koordinering med resten av verden. En kan ikke stenge seg fullstendig inne i siloen sin og glemme det som har fungert bra tidligere. Hvilke samhandlingsmekanismer bør en ha når en kaller seg et autonomt team?","type":"talk","start":"15:15","end":"15:45","date":"19","duration":15,"room":"Harmoni","speaker_bio":"Steinar har nøkkelkompetanse innenfor test- og kvalitetssikring av samfunns- og virksomhetskritiske systemer. Han har fokus på effektivt å levere systemer med riktig kvalitet og løpende vurdere tiltak for å ta ned risiko.\r\n\r\nSteinar har bred erfaring med smidige metoder, tjenesteorientert arkitektur, analyse og design, objektorientert modellering og utvikling, applikasjonsintegrasjon, prosjekt- og testledelse, leveranseplanlegging og utrullingsstrategier, etablering av testmiljøer, vurdering og test av ytelse, oppfølging mot driftsleverandører, datamigrering, databasesystemer og datafangst for datavarehus og andre rapporteringsløsninger.\r\n\r\nMed sin bakgrunn kan Steinar løpende kvalitetssikre løsningsvalg og være en sparringpartner for prosjektledere, arkitekter og utviklere i et prosjektløp eller i applikasjonsforvaltning. Og han er samtidig vant til å ha teamlederrollen i et autonomt, selvorganiserende team.","speaker_favourites":null,"speaker_recreation":null}}},{"node":{"data":{"title":"Middag for alle","userIds":null,"email":null,"description":"Middag for alle andre 5 restaurantene","type":"other","start":"19:30","end":null,"date":"20","duration":null,"room":null,"speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null}}},{"node":{"data":{"title":"Open Space","userIds":null,"email":null,"description":"Open Space","type":"talk","start":"16:00","end":"16:30","date":"19","duration":30,"room":"Idea","speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null}}},{"node":{"data":{"title":"Medisinsk simulering som et distribuert system","userIds":"Aleksander Pettersen","email":"aleksander.pettersen@knowit.no","description":"Laerdal Medical har de siste femten årene basert mye av simuleringen sin på noen få applikasjoner. Disse monolittene skulle dekke hvert sitt domene men har over tid utviklet seg til å prøve å favne over alle simuleringsdomener - med overlapping av hverandre. LM ønsket en fleksibel arkitektur som tillater rask prototyping samt klinisk nøyaktighet - dette arbeidet er påbegynt.","type":"talk","start":"13:45","end":"14:15","date":"19","duration":30,"room":"Harmoni","speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null}}},{"node":{"data":{"title":"Twenty Thousand Leagues Under The Sea","userIds":"Espen Tjønneland","email":"etj@knowit.no","description":"Hvordan behandle data tilsvarende 15.000 Netflix filmer i sekundet i sanntid.","type":"talk","start":"14:00","end":"14:15","date":"19","duration":15,"room":"D","speaker_bio":"Espen er en meget erfaren multirolleprofil med spesiell tyngde innen store, teknisk komplekse, prosjekter. \r\nMed erfaring innen teknisk prosjektledelse, systemarkitektur, og i tillegg mange års programmeringserfaring er han en meget godt egnet kandidat til moderne systemutviklingsprosjekter for kunder som ønsker om å gjennomføre digitale transformasjoner. Han evner å forstå de forretningsmessige problemstillingene som er relevante i brytningen mellom forretning og teknologi. \r\nEspen er sertifisert Scrum Master og har god kunnskap om bruk av smidige metoder i forbindelse med systemutvikling og praktisk prosjektgjennomføring, herunder micro service arkitektur og DevOps metode i moderne skybaserte miljø.\r\nEspen har arbeidet med store smidigprosjekter, herunder ansvar for arkitektur for Oslo Kommunes ITAS-prosjekt\r\n","speaker_favourites":null,"speaker_recreation":null}}},{"node":{"data":{"title":"Andre fly til Praha (Norwegian)","userIds":null,"email":null,"description":"Andre fly til praha","type":"other","start":"19:00","end":"22:00","date":"18","duration":null,"room":null,"speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null}}},{"node":{"data":{"title":"Svelte: Det raske rammeverket uten VDOM ","userIds":"Eirik Vågeskar","email":"eirik.vageskar@knowit.no","description":"Én ting kan stoppe Svelte i å bli noe stort: At React og Vue lærer av det, og det litt kvikt. For hvilken Javascript-utvikler har ikke lyst på bittesmå bundles, rask ytelse og kort utviklingstid? Dette foredraget presenterer Svelte og hvordan det brukes hos Entur sammen med React. \n\nEirik Vågeskar har lekt med Svelte i noen måneder. På den tiden har han rukket å stifte Svelte-guild, å bidra til Svelte på Github og å ta i bruk Svelte på prosjekt i Entur. Til tross for åpenbar partiskhet, lover han å gi en nøktern fremstilling av fordeler og ulemper i foredraget. ","type":"talk","start":"13:45","end":"14:00","date":"19","duration":30,"room":"D","speaker_bio":"Eirik har vært ansatt i Knowit Objectnet siden høsten 2017. Før dette tok han en utdanning som sivilingeniør i datateknologi ved NTNU i Trondheim, der han spesialiserte seg innen kunstig intelligens.  \n\nSiden ansettelsen har han jobbet som frontend-utvikler. Han bruker også mesteparten av fagtiden på det, som medlem av faggruppene for frontend-utvikling og for brukeropplevelse. Han er en ihuga tilhenger av «clean code», og er opptatt av å skrive kode som er pålitelig, rask og lettlest. \n\nHan er glad i å jobbe med oppgaver som krever mye tenking. Ved kontorpulten jobber han helst i stillhet. I pauser såvel som etter arbeidstid liker han å prate.","speaker_favourites":null,"speaker_recreation":null}}},{"node":{"data":{"title":"Funksjonelle programmerings-konsepter forklart med dårlige metaforer og stygge tegninger.","userIds":"Tale Prestmo","email":"tale.prestmo@gmail.com","description":"Synes du at ord som \"monad\", \"functor\", \"side effects\", \"function composition\" (I could go on forever), eller rett of slett bare \"funksjonell programmering\" er litt vanskelig å forstå? Ønsker du flere knagger å henge konseptene på? Kom til en litt utradisjonell presentasjon, der et utvalg av disse blir forklart med dårlige metaforer, akkompagnert av stygge tegninger som jeg har laga helt sjæl.","type":"talk","start":"15:15","end":"15:30","date":"19","duration":15,"room":"D","speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null}}},{"node":{"data":{"title":"Fritid","userIds":null,"email":null,"description":"Fritid","type":"other","start":"13:00","end":"18:30","date":"20","duration":null,"room":null,"speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null}}},{"node":{"data":{"title":"Pause","userIds":null,"email":null,"description":"Pause","type":"other","start":"14:15","end":"14:30","date":"19","duration":null,"room":null,"speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null}}},{"node":{"data":{"title":"Lunsj","userIds":null,"email":null,"description":"Lunsj","type":"other","start":"12:00","end":"13:00","date":"19","duration":null,"room":null,"speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null}}},{"node":{"data":{"title":"Transfer til flyplass","userIds":null,"email":null,"description":"Transfer til flyplass","type":"other","start":"14:30","end":null,"date":"21","duration":null,"room":null,"speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null}}},{"node":{"data":{"title":"Genus","userIds":"René Raisanen","email":"rene.raisanen@knowit.no","description":null,"type":"talk","start":"13:45","end":"14:15","date":"19","duration":30,"room":"B","speaker_bio":"Gjennom sine erfaringer med kunder og gjester i andre bransjer har René bygget seg opp en god evne til å avdekke nødvendige behov og finne gode løsninger til disse. I årene før han ble ansatt lå fokuset på å benytte JavaScript og tilhørende rammeverk, blant annet Node.js og Vue.js, til å bygge enkle, men effektive brukergrensesnitt og verktøy. \r\n\r\nI sitt første prosjekt for Knowit ble han satt til å jobbe backend med et stort sammensatt prosjekt hvor han viste initiativ til å sette seg inn i og lære hvordan både teknologiene og prosjektet fungerte. Det tok ikke lang tid før han var produktiv selv med mange teknologier som han tidligere ikke var kjent med.","speaker_favourites":null,"speaker_recreation":null}}},{"node":{"data":{"title":"Vue plugins! Hva, hvordan og hvorfor","userIds":"Henning Lund-Hanssen","email":"henning.lund-hanssen@knowit.no","description":"En erfaringsreise fra Oslo kommune med knockout, vue og vue plugins","type":"talk","start":"14:45","end":"15:00","date":"19","duration":15,"room":"D","speaker_bio":"Henning er lidenskapelig opptatt av nye og bedre måter vi kan drive systemutvikling på. Han trives godt i team, jobber aktivt for et godt samarbeid og er lett omgjengelig. Han har erfaring med å utforme løsningsforslag, arkitektur og estimering og synes det er viktig å se et større bilde av oppgavene som skal utføres. Kjernekompetansen hans ligger innen programmering med Scala og React/Redux som gjør at han føler seg komfortabel på både frontend og backend. Hovedfokuset hans ligger i å utvikle løsninger som tilfører neste person minst mulig hodebry i det en endring må til.\n\nHenning trives best som full stack-utvikler hvor han kan være med på å ta i et tak akkurat der det trengs.","speaker_favourites":null,"speaker_recreation":null}}},{"node":{"data":{"title":"Pause","userIds":null,"email":null,"description":"Pause","type":"other","start":"09:30","end":"09:45","date":"20","duration":null,"room":null,"speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null}}},{"node":{"data":{"title":"Pause","userIds":null,"email":null,"description":"Pause","type":"other","start":"10:00","end":"10:15","date":"19","duration":null,"room":null,"speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null}}},{"node":{"data":{"title":"Brettspill","userIds":null,"email":null,"description":"Brettspill","type":"other","start":"22:00","end":null,"date":"20","duration":null,"room":null,"speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null}}},{"node":{"data":{"title":"Pause","userIds":null,"email":null,"description":"Pause","type":"other","start":"11:15","end":"11:30","date":"20","duration":null,"room":null,"speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null}}},{"node":{"data":{"title":"Open Space","userIds":null,"email":null,"description":"Open Space","type":"talk","start":"16:00","end":"16:30","date":"19","duration":30,"room":"D","speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null}}},{"node":{"data":{"title":"How do I quantum?","userIds":"Erik Lund","email":"erik.lund@knowit.no","description":"Enkel innføring i bruk av simulerte kvantemaskiner på JVM. Begreper rundt kvantemaskiner, hvorfor de kommer og hvordan kode ser ut for nybegynnere. ","type":"talk","start":"13:45","end":"14:00","date":"19","duration":15,"room":"C","speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null}}},{"node":{"data":{"title":"Middag","userIds":null,"email":null,"description":"Middag i mindre grupper","type":"other","start":"20:00","end":null,"date":"19","duration":null,"room":null,"speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null}}},{"node":{"data":{"title":"Open Space","userIds":null,"email":null,"description":"Open Space","type":"talk","start":"15:15","end":"15:45","date":"19","duration":30,"room":"Idea","speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null}}},{"node":{"data":{"title":"Open Space","userIds":null,"email":null,"description":"Open Space","type":"talk","start":"16:00","end":"16:30","date":"19","duration":30,"room":"Harmoni","speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null}}},{"node":{"data":{"title":"Pause","userIds":null,"email":null,"description":"Pause","type":"other","start":"15:00","end":"15:15","date":"19","duration":null,"room":null,"speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null}}},{"node":{"data":{"title":"Lunsj","userIds":null,"email":null,"description":"Lunsj","type":"other","start":"12:00","end":"13:00","date":"20","duration":null,"room":null,"speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null}}},{"node":{"data":{"title":"Mobbing på arbeidsplassen","userIds":"Geir Nohre-Solvang","email":"geinoh@knowit.no","description":"Et foredrag som setter fokus på mobbing på arbeidsplassen","type":"keynote","start":"09:45","end":"10:15","date":"20","duration":30,"room":"BCD","speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null}}},{"node":{"data":{"title":"Aktiviteter","userIds":null,"email":null,"description":"Aktiviteter / Fritid m/egen lunsj","type":"other","start":"09:00","end":"14:30","date":"21","duration":null,"room":null,"speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null}}},{"node":{"data":{"title":"Open Space","userIds":null,"email":null,"description":"Open Space","type":"talk","start":"13:45","end":"14:15","date":"19","duration":30,"room":"Idea","speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null}}},{"node":{"data":{"title":"Brettspill","userIds":null,"email":null,"description":"Brettspill","type":"other","start":"22:00","end":null,"date":"19","duration":null,"room":null,"speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null}}},{"node":{"data":{"title":"Frokost","userIds":null,"email":null,"description":"Frokost","type":"other","start":"07:00","end":"09:00","date":"19","duration":null,"room":null,"speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null}}},{"node":{"data":{"title":"En mer produktiv arbeidsdag med bedre møter!","userIds":"Dr. Viktoria Stray, SINTEF/UiO","email":null,"description":"Viktoria Stray fra SINTEF, kjent i Norge som “Dr. Smidig”, gir oss innblikk i smidig forskning og tips for en bedre møtehverdag.\n\nHva kan vi gjøre for å få det beste ut av møtene i prosjektene våre? Alle er i møter og har en mening om møter, men hva sier forskning om møter? Gjennom å studere bedrifter som gjennomfører digitaliseringsprosjekter, har Viktoria fått innsikt i møtene til alt fra finansfolk til byråkrater.\n\nEt godt møte bør være nyttig for bedriften, gjøre de ansatte bedre rustet til å jobbe sammen og oppleves som meningsfylt for møtedeltagerne der og da.\n\n\nDu får Viktorias beste tips, og inspirasjon til å holde produktive og gode møter.\n\nDr. Smidig: https://www.dataforeningen.no/dr-smidigs-standup-diagnose-endret-norge/","type":"keynote","start":"10:15","end":"11:00","date":"19","duration":30,"room":"BCD","speaker_bio":"Viktoria Stray er møteforsker og ekspert på smidige arbeidsformer. Hun jobber som førsteamanuensis på Universitetet i Oslo og forsker på SINTEF.\n\n\nVi kjenner henne fra Knowits forskningssamarbeid, dessuten bidrar hun til Knowit Academy med en sesjon på utviklingsprosesser.\nHun er utdannet sivilingeniør i datateknikk fra NTNU og hun har en PhD i software engineering fra universitetet i Oslo. Stray har også flere års industrierfaring som IT-konsulent i Accenture. Hun jobber tett med bedrifter innen finans og IT.\n\nhttps://www.linkedin.com/in/viktoriastray/","speaker_favourites":null,"speaker_recreation":null}}},{"node":{"data":{"title":"Pause","userIds":null,"email":null,"description":"Pause","type":"other","start":"15:45","end":"16:00","date":"19","duration":null,"room":null,"speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null}}},{"node":{"data":{"title":"Open Space","userIds":null,"email":null,"description":"Open Space","type":"talk","start":"16:00","end":"16:30","date":"19","duration":30,"room":"B","speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null}}},{"node":{"data":{"title":"Hvordan virker en regnestav?","userIds":"Hans Christian Brodwall Nielsen","email":"hcn@knowit.no","description":"Jeg har lyst til å holde et foredrag om regnestaver.  Matematikken som ligger bak, og praktisk bruk.","type":"talk","start":"15:15","end":"15:45","date":"19","duration":30,"room":"B","speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null}}},{"node":{"data":{"title":"Mikrotjeneste med Spring; fra Java til Kotlin","userIds":"Frode Ånonsen","email":"froano@knowit.no","description":"Eksempel på å migrere en enkel Spring Boot basert mikrotjeneste fra Java til Kotlin.\nPain points, lessons, etc.\n\n* Sette context, vise oversikt over tjeneste, kjøremiljø\n* Se gjennom kode, byggescript\n* Refaktorere til Kotlin, forenkle. Teste.\n* Refaktorere bygg til KotlinScript. Demonstrere Gradle/KTS med intellisense. Teste.\n* Bygge\n* Oppsummering","type":"talk","start":"13:00","end":"13:15","date":"19","duration":15,"room":"C","speaker_bio":"Frode Ånonsen er en erfaren utvikler. Frode har bakgrunn fra IT-design og -ariktektur, samt applikasjonsutvikling. Han skriver kode i høy kvalitet basert på de anerkjente SOLID prinsippene, hvor han benytter hensiktsmessige designmønstre.\r\nFrode er en erfaren full-stack utvikler og en entusiastisk og pålitelig konsulent, og er et positivt tilskudd til et team.\r\nVidere har han erfaring med smidige utviklingsmetodikker som Scrum og Kanban og test-drevet utvikling. Han har over 20 års erfaring med blant annet Javascript, Scala, Clojure, Java, C#/.Net og andre teknologier.\r\nHan kjenner godt til åpne teknologier som Linux, Apache, Nginx, Mysql, Postgresql, Neo4j, Datomic, Docker, Kubernetes, Openshift osv.\r\n\r\nFrode er også fagansvarlig i Knowit Stavanger.","speaker_favourites":null,"speaker_recreation":null}}},{"node":{"data":{"title":"Open Space","userIds":null,"email":null,"description":"Open Space","type":"talk","start":"16:00","end":"16:30","date":"19","duration":30,"room":"Grazia","speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null}}},{"node":{"data":{"title":"Hvordan brukes AI i industri?","userIds":"Eirik Folkestad","email":"eirik.folkestad@knowit.no","description":"World Summit AI i Amsterdam 9-10 oktober 2019 er en ledende konferanse innen AI som samler akademia og industri under et tak. Konferansen har da et spesielt fokus på AI i industri og har et program bestående av talks fra bedrifter som Facebook, Google og Alibaba for å nevne noen. Denne talken vil være en videreformidling av lærdom/erfaringer/idéer tilegnet fra talkene holdt under denne konferansen.","type":"talk","start":"13:00","end":"13:15","date":"19","duration":15,"room":"Idea","speaker_bio":"Master i Datateknologi fra NTNU med faglig tillegg i maskinlæring ved Auckland University of Technology og University of Melbourne. Jobber som full-stack utvikler med Javascript-baserte rammeverk som React, Node og Java-rammeverk som Spring. Har også tidligere erfaring med Python og funksjonelle språk som Haskell. Eirik har fordypet seg i maskinlæring i sin mastergrad og har vært med på å utvikle et system som tar i bruk maskinlæringsmetoder for å klassifisere banktransaksjoner til kategorier basert på deres tekstlige beskrivelse.","speaker_favourites":null,"speaker_recreation":null}}}]}}}