{"data":{"allAirtable":{"edges":[{"node":{"data":{"title":"Frokost","userIds":null,"email":null,"description":null,"type":"other","start":"06:30","end":"10:30","date":"21","duration":null,"room":null,"speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null,"speaker_image":null}}},{"node":{"data":{"title":"How to write code worth reading","userIds":"Sten Christoffer Eliesen","email":"christoffer.eliesen@knowit.no","description":"Regardless of skill level, some programmers write code that is performant, bug free and works great, but is very difficult to read and understand, and thus difficult to maintain. So in this talk I would like to share my experience and explain how you can write code that is easier to maintain","type":"talk","start":"14:30","end":"15:00","date":"19","duration":30,"room":"Grazia","speaker_bio":"Christoffer er en engasjert utvikler som brenner for IT. Han er nysgjerrig og glad i å lære nye ting. Han stiller høye krav til seg selv og det han leverer, men er pragmatisk når det trengs. Hans interesse for IT spenner seg hele veien fra operativsystem til brukergrensesnitt, og han er derfor en naturlig fullstack og \"devops\" utvikler. I disse tider er det frontend som er i vinden og Christoffers hjerte følger etter. React og Node er spennende teknologier som passer han midt i blinken. Over ti års erfaring har gjort han trygg i rollen som konsulent. Han er en dyp tenker og liker å løse vanskelige problemer.","speaker_favourites":null,"speaker_recreation":null,"speaker_image":null}}},{"node":{"data":{"title":"Utviklingsmiljø i skyen","userIds":"Øyvind Marthinsen","email":"oma@knowit.no","description":"Kjøring av applikasjoner i skyen er nå blitt den nye normen, men fortsatt sitter vi å utvikler applikasjonene på personlige maskiner. I dette foredraget vil jeg gå igjennom min ferd i å sette opp og bruke et utviklingsmiljø i skyen.\n\nJeg kommer til å gå igjennom motivasjonen for dette, fortelle om noen mislykkede fremgangsmåter og gi en oversikt over oppsettet jeg endte på.","type":"talk","start":"14:30","end":"15:00","date":"19","duration":30,"room":"Harmoni","speaker_bio":"Øyvind er en engasjert utvikler som brenner for utvikling av moderne web applikasjoner. Han er også veldig interessert i verktøy og scripting for å å gjøre utvikling mer effektiv for seg selv og andre.","speaker_favourites":"Bouillabaisse;Hip Hop;Et sted jeg ikke har vært tidligere;The Wire;Hytta","speaker_recreation":"Jeg har en 1,5 år gammel sønn. Så jeg har aldri fri :P","speaker_image":{"localFiles":[]}}}},{"node":{"data":{"title":"How can statistics about Oslo municipality be more fun with D3.js","userIds":"Aulon Mujaj","email":"aulon.mujaj@knowit.no","description":"La meg vise deg historien hvordan vi greide å gi Oslo kommune sine faktaark og statistikksider om bydelene og delbydelene en makeover til noe fint og lettleselig statistikk ved bruk av grafbiblioteket D3 og javascript rammeverket VueJS! Ikke mer titalls timer arbeid om å manuelt lage grafer i excel, når d3 og vue kan gjøre dette automatisk for deg!","type":"talk","start":"13:00","end":"13:30","date":"19","duration":30,"room":"D","speaker_bio":"Begynte hos knowit i 2017 som fulltidsansatt, jobber for Oslo kommune - Origo, som frontendutvikler. Spesielisert i VueJS men kan også litt reactjs her og der.","speaker_favourites":"Burger;Elektronika;Kosovo;Serie: Lost - Film: Matrix;Under brugata","speaker_recreation":"Aulon liker å spille squash på fritiden, se på alt for mange tv-serier i uka og generelt bare ta ei litta øl her og der.","speaker_image":{"localFiles":[{"publicURL":"/static/Aulon_Mujaj-3-AulonMujaj-59d53454540c6b2e54910a9dfce44e22.jpg"}]}}}},{"node":{"data":{"title":"My Life as a Cyborg, aka \"Helpless without my tools\"","userIds":"Michael Johansen","email":"michael.johansen@knowit.no","description":"Klarer du deg godt som voksen? Overalt rundt deg er det vekter som ikke må tippe for langt ut til den ene enden siden, eller den andre. I dette foredraget gjør jeg et dypdykk inn i hvordan jeg balanserer og indekserer livet, hvor det har gått så langt jeg ikke klarer meg uten verktøyene, som en kyborg. Todolisten min inneholder 2.4 millioner tegn.","type":"talk","start":"14:30","end":"15:00","date":"19","duration":30,"room":"B","speaker_bio":"Er konsulent på dagen. Driver startup på natten.","speaker_favourites":"Guy Lian chocolate seashells;Techno;Hawai'i;Rick and Morty;Nydalen","speaker_recreation":"Driver startup. Er lidenskapelig interessert i organisasjonskart (tenk at det går an).","speaker_image":{"localFiles":[{"publicURL":"/static/michael-d9af204d9dab389a8022d81425b84280.johansen"}]}}}},{"node":{"data":{"title":"Solflekktelling med Java i baksetet","userIds":"Jan Alvestad","email":"jan.alvestad@knowit.no","description":"Gjennomgang av hvordan solflekker telles og hva som har skjedd siden Galilei begynte med det for over 400 år siden. Beskrivelse av prosessen der målet er å automatisere tellingen ved hjelp av bildemanipulasjon i Java","type":"talk","start":"14:30","end":"14:45","date":"19","duration":15,"room":"C","speaker_bio":"Testutvikler med mangeårig interesse for vitenskap, spesielt magnetiske fenomen på sola.","speaker_favourites":";;;;","speaker_recreation":null,"speaker_image":{"localFiles":[{"publicURL":"/static/jan-42584c4cf126ae26f99452622b874838.alvestad"}]}}}},{"node":{"data":{"title":"What’s hot and what’s not in the World of Agile","userIds":"Arne Løvold","email":"arne.lovold@knowit.no","description":"Hva er det som rører seg i den smidige verden? Noen eksempel og kommentarer på nyere tema, metoder og prosesser fra det lokale fagmiljøet og internasjonale trender. ","type":"talk","start":"13:00","end":"13:30","date":"19","duration":30,"room":"B","speaker_bio":"Avdelingsleder for verdens beste avdeling, og daglig tjener for en verdens flinkeste gruppeledere. Har også en faglig fot innen Smidig systemutvikling gjennom Smidigkonferansen og vårt forskningssamarbeid med Sintef. Driver daglig med GDL, UF, NDLA, Statsbygg og Ruter. Ivrig basketentusiast som er glad i å reise på basketkamper og til noen andre plasser i Europa. Stolt redaktør av Baksia!","speaker_favourites":"Pizza;Rock og pop;London;Gladiator/GoT;Briskeby","speaker_recreation":"Ser på basketkamper","speaker_image":null}}},{"node":{"data":{"title":"Fly til Oslo","userIds":null,"email":null,"description":"Fly fra Praha til Oslo (QS4360)","type":"other","start":"17:00","end":"19.00","date":"21","duration":null,"room":null,"speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null,"speaker_image":null}}},{"node":{"data":{"title":"Hvordan redder Knowit verden?","userIds":"Klaus Stafto","email":"klaus.stafto@knowit.no","description":"Om Knowits målsetting og bidrag til klima/bærekraft. Samt bittelitt om bistand.","type":"keynote","start":"09:00","end":"09:30","date":"20","duration":30,"room":"BCD","speaker_bio":"Konsulent i Knowit (og oppkjøpte forløpere) siden 2001, med noen mindre avbrekk. Interessert i klima og miljøvern. For tiden prosjektleder hos kunder. Gruppeleder ved trondheimskontoret. ","speaker_favourites":"Alt som er godt. Ikke ansjos på pizza.;Litt av hvert;Staselige slott;Nytt på nytt;Torgerstuen kafe (rip)","speaker_recreation":"Fryder meg over 2-årige Nor som fullstendig overskygger maskinlæring hva angår bildegjenkjenning, språkutvikling og det meste annen læring. :)\nEllers venner, familie og ymse tidvise verv.","speaker_image":{"localFiles":[{"publicURL":"/static/klaus-3a7834e3389d37a374a8e3ec87d16ef5.stafto"}]}}}},{"node":{"data":{"title":"Hyperfluid Edge computing platform","userIds":"Per Buer","email":"per.buer@knowit.no","description":"Hyperfluid er et ikke-eksisterende prosjekt for å kombinerte smart bruk av Webassembly, WASI og service discovery til å tilby en slags liten ec2 i en liten eske. Målet er at et nettverk, f.eks. om bord i en buss, skal kunne konsumere compute-ressurser på en enkel og trygg måte.\n\nDu skal kunne pakke en backend inn i en klient, f.eks. i en app eller mikrokontroller-enhet. Når app'en så kommer seg på nett så vil den søke seg frem til lokale dataressurser og til kunne konsumere disse for å tilby nye og innovative tjenester.","type":"talk","start":"15:15","end":"15:45","date":"19","duration":30,"room":"C","speaker_bio":"Per startet som Perl-programmerer, jobbet som sysadmin noen år og vært med på å bygge en del selskap i forskjellige roller. Veldig glad for å jobbe med teknologi igjen.","speaker_favourites":"Vanskelig å slå en god biff; Japansk LoFi hiphop;  Hoi An, Vietnam;Groundhog Day","speaker_recreation":"Brygger surøl. Brenner fingrene på loddebolten.","speaker_image":{"localFiles":[{"publicURL":"/static/TBF_9489-25393b9205d00f6e020710c13ddc4d8a.jpg"}]}}}},{"node":{"data":{"title":"Fritid","userIds":null,"email":null,"description":"Her burde alle gjøre seg klare til middag. Etter dette går det slag i slag til middag. ","type":"other","start":"16:30","end":"17:30","date":"19","duration":null,"room":null,"speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null,"speaker_image":null}}},{"node":{"data":{"title":"Middag","userIds":null,"email":null,"description":"Middag på Maitrea","type":"other","start":"18:30","end":null,"date":"20","duration":null,"room":null,"speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null,"speaker_image":null}}},{"node":{"data":{"title":"Graph først!","userIds":"Audun Halland","email":"audun.halland@knowit.no","description":"\nEt lite dykk i hvordan et GraphQL-skjema kan fungere som et nyttig modelleringsverktøy tidlig i utviklingsfasen, hvordan det kan skaleres, og hvorfor backendutviklere også bør ha et forhold til det.","type":"talk","start":"15:30","end":"15:45","date":"19","duration":15,"room":"D","speaker_bio":"Audun jobber hos Universitetsforlaget med å lage webtjenesten Juridika","speaker_favourites":"Ost;Bra musikk;Universet;Twin Peaks;Vålerenga","speaker_recreation":"Programmerer, spiller musikk og henger med barna","speaker_image":{"localFiles":[{"publicURL":"/static/audun-ff65a18cd06f80497511b8ff62926e7d.halland"}]}}}},{"node":{"data":{"title":"Open Space","userIds":null,"email":null,"description":null,"type":"talk","start":"16:00","end":"16:30","date":"19","duration":30,"room":"C","speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null,"speaker_image":null}}},{"node":{"data":{"title":"Presentasjon X","userIds":"Marit Hellestø","email":"marit.hellesto@knowit.no","description":"Project X, et prosjekt som var både ambisiøst, brukte bleeding edge teknologier og var banebrytende innen sitt marked, så mye at man av konkurransehensyn ikke kunne kalle prosjektet noe mer beskrivende. \n\nDenne presentasjonen tar for seg de erfaringene man fikk i løpet av en 3årsperiode, fra oppstart av prosjektet til den største leveransen i prosjektet. Og det denne tiden inneholdt av oppturer og nedturer. ","type":"talk","start":"15:15","end":"15:45","date":"19","duration":30,"room":"B","speaker_bio":"Fagleder og Systemutvikler i Knowit Experience Bergen. Jobber nå med utvikling av systemer for BankID. Liker å være med å arrangere ting, så er derfor en del av Boosterkomitéen i Bergen. Ellers liker jeg friluftsliv og klatring og utfordrer gjerne høydeskrekken med litt luftige fjellturer. ","speaker_favourites":"Kake;electronica/klassisk/pop;London;Så nylig Parasitt på BIFF, fantastisk film;Liafjell (Sotra, utfor Bergen)","speaker_recreation":"Frivillig i RødeKors i et program som heter Døråpner, Programansvarlig i Boosterkomiteen, klatrer og prøver å øve til halvmaraton mellom slaga :D","speaker_image":{"localFiles":[{"publicURL":"/static/IMG_7537-Edit-MaritHellest-0dce8cbd05c6426d59b323663ea1d15a.jpg"}]}}}},{"node":{"data":{"title":"Vi tar pulsen på Knowit - vår interne dataplattform","userIds":"Jan Henrik Gundelsby og Torbjørn Moen","email":"jhg@knowit.no","description":"Jan Henrik og Torbjørn snakker om Knowit sin interne dataplattform. Hvorfor har vi en intern dataplattform, hvordan gjør vi det, hvem og hvordan kan du bidra. Også blir det litt faktiske resultater fra data som er samlet inn og satt sammen.","type":"keynote","start":"11:25","end":"11:45","date":"19","duration":20,"room":"BCD","speaker_bio":"Jan Henrik er en glad speidergutt som liker alt mulig rundt teknologi. Er for tiden Principal Engineer og CTO i Knowit Objectnet. \n\nTorbjørn skriver ungdomsbøker og fører titt og ofte en indre dialog med en fjortis. Han har hovedansvaret for offentlig sektor i Objectnet.","speaker_favourites":"Jan Henrik elsker pizza. Torbjørn også.;Jan Henrik hører på 80-talls heavy og 90-talls grunge, og listepop. Torbjørn hører egentlig på hva som helst. For tiden går det i Tom Waits og Sigrid.;Jan Henrik liker seg best på fjellet. New York på Torbjørn.;Jan Henrik har ikke tid til å se på tv. Det har Torbjørn, og her er det sinnsykt mye å velge mellom. Den siste serien han binga var \"Happy\" på Netflix. Fullstendig sprø!;Jan Henrik liker seg i Østmarka. Torbjørn tenker at det gjør han også. Det er enten Haukåsen eller ... vel, sofaen.","speaker_recreation":"Jan Henrik er pappa til 3 jenter. Enough said. Torbjørn skriver bøker og ser på fotball.","speaker_image":{"localFiles":[{"publicURL":"/static/IMG_7518-5030da7fd94596441728ecaa7c6d1576.jpg"}]}}}},{"node":{"data":{"title":"Fingermat ","userIds":null,"email":null,"description":"Alle må fylle ut registreringskortet de fikk utdelt sammen med nøkkelen. Dette er viktig å gjøre på grunn av Tsjekkisk lov der dette må være klart før neste morgen. Gjør det med en gang!","type":"other","start":"22:00","end":null,"date":"18","duration":null,"room":"Euforia","speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null,"speaker_image":null}}},{"node":{"data":{"title":"Brukervennelige APIer","userIds":"Anders R. Dahlen","email":"anders.dahlen@knowit.no","description":null,"type":"talk","start":"13:45","end":"14:15","date":"19","duration":30,"room":"Grazia","speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null,"speaker_image":null}}},{"node":{"data":{"title":"Hvordan sikre REST-API med OpenID Connect/OAuth2","userIds":"Yngvar Kristiansen","email":"yngvar.kristiansen@knowit.no","description":"Presentasjon viser hvordan vi enkelt kan sikre et REST API med OpenID Connect (OIDC). OIDC er en industristandard for autorisering, og nyttig å kunne dersom man jobber med APIer eller arkitektur.\n\nVi gjennomgår hvordan man setter opp et sikret API, hvordan man aksesserer API-et med en token, samtidig som vi tar for oss ulike sikringsmetoder i Oauth2 (flows). Kode vil bli vist i Java og Spring Boot, mens Keyclok brukes som OIDC-provider. Hvis det blir tid ser vi hvordan vi kan konsumere API-et fra en frontend.","type":"talk","start":"14:45","end":"15:00","date":"19","duration":15,"room":"C","speaker_bio":"Yngvar er utvikler og har jobbet med back-end, front-end, drift og programvarearkitektur. Konsulenten har erfaring fra komplekse, forretningskritiske applikasjoner, behandling av store datamengder, og web-applikasjoner. Han har erfaring med flere deler av FSUM: Kravhåndtering, konstruksjon, test og estimering.\r\n\r\nYngvar har personlig interesse for devops, kodekvalitet, testing, arkitektur og brukervennlighet, og fokuserer alltid på å gjøre ting riktig framfor å ta snarveier. Samtidig sikter han på å løse forretningsbehov, og er løsningsorientert i arbeidet sitt.\r\n\r\nSmidig teamarbeid og diskusjoner er noe Yngvar er vant med og trives med, og han ses på som en lagspiller. Han jobber likevel godt selvstendig, er systematisk og en pådriver for progresjon.\r\n","speaker_favourites":null,"speaker_recreation":null,"speaker_image":null}}},{"node":{"data":{"title":"Pause","userIds":null,"email":null,"description":null,"type":"other","start":"10:15","end":"10:30","date":"20","duration":null,"room":null,"speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null,"speaker_image":null}}},{"node":{"data":{"title":"Karakteristika ved Autonome team – funn fra Spotify","userIds":"Nils Brede Moe","email":"nilsm@sintef.no","description":"Gjennom vår forskning i Spotify har vi funnet hva som kjennetegner de autonome team som ser ut til å fungere godt og de som har utfordringer. Vi har også sett på hvordan teamene samarbeider innen en «Tribe» og på tvers av hele organisasjonen, og hva ledere må gjøre for å tilrettelegge for autonomi. Hvordan gode team håndterer avhengigheter til andre team overrasket oss.","type":"keynote","start":"11:30","end":"12:00","date":"20","duration":30,"room":"BCD","speaker_bio":"Entusiastisk sjefsforsker som har jobbet med agile, kunnskapsforvaltning, sourcing og og autonome team i 15 år,  og som har gjort feltstudier i Asia, Europa og USA. Forsker på de problemstillinger som potensielt kan gi folk en bedre jobbhverdag. Hvis problemstillingene er enkle eller har lav relevans for industrien kan andre løse de. ","speaker_favourites":"Asiatisk. Gjerne Thai ;Kommer an på hva jeg gjør;Sydney eller outbacken i Australia ;Le Bureau des Légendes (nå);Coogee Beach - Sydney ","speaker_recreation":"Trene, trener andre, ski, sykkel, på tur i skog og mark, og gjerne med hagle i september. ","speaker_image":{"localFiles":[{"publicURL":"/static/NilsBredeMoeSINTEF-NilsBredeMoe-38e48a05afc7f4b4c199b584e9394ba7.jpeg"}]}}}},{"node":{"data":{"title":"Hva er verdens største sikkerhetshull?","userIds":"Per Buer","email":"per.buer@knowit.no","description":"Dagens operativsystem er i all hovedsak like. De er egentlig designet for en annen tid og laget for andre oppgaver enn vi gir dem idag. Det største problemet er rundt sikkerhet - vi har gitt dem muligheten til å endre seg selv. Hvorfor er det slik? Må det være slik?","type":"talk","start":"13:15","end":"13:30","date":"19","duration":15,"room":"C","speaker_bio":"Per startet som Perl-programmerer, jobbet som sysadmin noen år og vært med på å bygge en del selskap i forskjellige roller. Veldig glad for å jobbe med teknologi igjen.","speaker_favourites":"Vanskelig å slå en god biff; Japansk LoFi hiphop;  Hoi An, Vietnam;Groundhog Day","speaker_recreation":"Brygger surøl. Brenner fingrene på loddebolten.","speaker_image":{"localFiles":[{"publicURL":"/static/TBF_9489-25393b9205d00f6e020710c13ddc4d8a.jpg"}]}}}},{"node":{"data":{"title":"På innsiden av nytt folkeregister","userIds":"Rune Myrdal","email":"rmy@knowit.no","description":"I 2020 får Norge nytt folkeregisteret. Arbeidet med det nye folkeregisteret har pågått i lengre tid og flere i Knowit Objectnet har bidratt. \nProsjektet leverer nye tjenester for mottak av informasjon, automatisert og raskere saksbehandling samt kontinuerlig oppdatert utlevering av informasjon. \n\nJeg skal ta dere med på innsiden av det nye Folkeregisteret, ta dere gjennom noen utfordringer og vise hva vi jobber med i prosjektet.\n","type":"keynote","start":"10:30","end":"11:15","date":"20","duration":45,"room":"BCD","speaker_bio":"Rune har jobbet i Knowit Objectnet siden 2003 og har mer enn 20 års erfaring som utvikler/arkitekt. \nPå Folkeregisteret jobber han som utvikler og teamarkitekt på “register”-teamet.","speaker_favourites":"Sushi;Musikk fra 80-tallet;Hvor som helst i alpene, der det er mest nysnø;;","speaker_recreation":"Løper og går/står på ski. Om sommeren trives jeg best på Hvaler, i eller bak båten på ski.","speaker_image":{"localFiles":[{"publicURL":"/static/RuneMyrdal_square-RuneMyrdal-24bc302e493f07390bd87f54ec909f83.jpg"}]}}}},{"node":{"data":{"title":"Frokost","userIds":null,"email":null,"description":null,"type":"other","start":"06:30","end":"09:00","date":"20","duration":null,"room":null,"speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null,"speaker_image":null}}},{"node":{"data":{"title":"Pause","userIds":null,"email":null,"description":null,"type":"other","start":"13:30","end":"13:45","date":"19","duration":null,"room":null,"speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null,"speaker_image":null}}},{"node":{"data":{"title":"A Paranoids Guide to Trusting Open Source","userIds":"Rickard Westberg","email":"rickard.westberg@knowit.se","description":"Softwares greatest business value is that it can be modified instantly. Open source software can be modified by almost anyone. This poses a real challenge in a world where everyone is out to get you.","type":"keynote","start":"09:40","end":"10:10","date":"19","duration":30,"room":"BCD","speaker_bio":"Rickard has worked for nearly two decades developing products for naval command and control at Swedish defence company Saab, and performing transition from proprietary code development to a high degree of open source usage in safety and security critical products.","speaker_favourites":"Something new. I get tired quickly.;Post-grunge, alternative rock.;Gotland;Apollo 13;","speaker_recreation":"I do volunteer work for a Sea Cadet organisation, educating teenagers in nautical navigation.","speaker_image":{"localFiles":[{"publicURL":"/static/RickardWestberg_2017_optimised-RickardWestberg-10392429e3c3094912a1b54919116df6.png"}]}}}},{"node":{"data":{"title":"Etisk AI - EUs etiske retningslinjer","userIds":"Torbjørn Moen","email":"torbjorn.moen@knowit.no","description":"En gjennomgang av EUs etiske retningslinjer for de som lager og tar i bruk AI","type":"talk","start":"13:15","end":"13:30","date":"19","duration":15,"room":"Idea","speaker_bio":"Torbjørn Moen har lang og bred erfaring som ansatt i offentlig sektor der han blant annet har jobbet som utviklingsleder, som produkteier og som prosjektleder for mange innovasjons- og utviklingsprosjekter. Han har vært med på reisen fra gammeldagse fossefallprosjekter til smidig produktutvikling i autonome team og har sett hva det kan gjøre med innovasjonstakten. Torbjørn har også en karriere som skjønnlitterær forfatter og har gitt ut nesten 20 romaner beregnet på barn og unge.","speaker_favourites":null,"speaker_recreation":null,"speaker_image":null}}},{"node":{"data":{"title":"Første fly til Praha (SAS) - SK4769","userIds":null,"email":null,"description":"SAS - SK4769","type":"other","start":"19:00","end":"20:55","date":"18","duration":null,"room":null,"speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null,"speaker_image":null}}},{"node":{"data":{"title":"Burde du utvikle apper med React Native?","userIds":"Patrick Monslaup","email":"patrick.monslaup@gmail.com","description":"React Native er en av mange moderne løsninger for å lage apper som lover alt mellom himmel og hav, men hvor godt fungerer det egentlig? I presentasjonen vil Patrick gå gjennom hva rammeverket gjør både bra og dårlig basert på halvannet års prosjekterfaring.","type":"talk","start":"14:30","end":"14:45","date":"19","duration":15,"room":"D","speaker_bio":"Fagleder og fullstack systemutvikler i Knowit Experience Bergen som jobber med både frontend og backend. Generelt nysgjerrig kar som liker å prøve nye ting. Unngår som regel regnvær, så det er egentlig rart jeg bor i Bergen.","speaker_favourites":"Burger;EDM;Mauritius;FMA: Brotherhood;Home is where my laptop is","speaker_recreation":"Du finner meg som regel med venner, om det så er foran tv, med et spill eller at vi finner på noe sammen.","speaker_image":{"localFiles":[{"publicURL":"/static/45159276_10161077430900451_7801944067553624064_o-PatrickMonslaup-784a9d2697a38f52b14f6a9c5e340c0e.jpg"}]}}}},{"node":{"data":{"title":"Open Space","userIds":null,"email":null,"description":null,"type":"talk","start":"14:30","end":"15:00","date":"19","duration":30,"room":"Idea","speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null,"speaker_image":null}}},{"node":{"data":{"title":"Velkommen til Praha - Knowit Awards - the pilot!","userIds":"Ledelsen","email":null,"description":"Velkommen til Praha! Litt praktisk informasjon og litt om hvorfor vi er best på faglig utvikling! Her kommer også pilotversjonen av Knowit Awards, der vi trekker frem folk som har gjort en forskjell siste perioden. Dette innenfor kategoriene: 1) Fag, 2) Markedsføring, salg og kundeutvikling, 3) Rekruttering og personlig utvikling og 4) Oppdrag.","type":"keynote","start":"09:00","end":"09:40","date":"19","duration":40,"room":"BCD","speaker_bio":"Ledelsen styrer skuta etter beste evne, for å kunne være best på folk, muligheter og på faglig utvikling.","speaker_favourites":"Ledelsen er glade i rødvin;Pearl Jam, Pink Floyd, Gogol Bordello, Violent femmes, Jokke, Volbeat og musicals.;;De ser på alt fra The Expense, Stranger Things, After Life, Lucifer, Game of Thrones og Dagsrevyen.;Roma, Holmsbu, Ossjøen, London, Veitastrond og generelt nye steder;","speaker_recreation":"På fritiden synger de i kirkekor, går på bar, driver med langdistanseseiling, korps. Er fotballsupportere- og trenere, basket og fisking.","speaker_image":{"localFiles":[{"publicURL":"/static/IMG_0057-c5c6215353df503e59e0132fb71f9fcd.jpg"}]}}}},{"node":{"data":{"title":"Oppdagelsesferd i gamle-byen","userIds":null,"email":null,"description":"👠 er ikke anbefalt. Vi ender opp på restaurantene.","type":"other","start":"18:30","end":"20:00","date":"19","duration":null,"room":"BCD","speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null,"speaker_image":null}}},{"node":{"data":{"title":"Peer Reviews I've Loved Before","userIds":"Tom Fagerland","email":"tom.fagerland@knowit.no","description":"En kort oversikt over hva man skal og ikke skal gjøre i Peer Review, med noen oppløftende eksempler. No naming, no shaming!","type":"talk","start":"15:15","end":"15:30","date":"19","duration":15,"room":"Grazia","speaker_bio":"Backendutvikler på Entur Salg - liker hunder og PCer, og å ta ordet uten å be om lov først","speaker_favourites":"For tiden fried chicken;For tiden prog-rock;Storbyer jeg ikke har vært i før;The Wire;Brewdog","speaker_recreation":"Noe i sofaen","speaker_image":{"localFiles":[{"publicURL":"/static/tom-5ce98dcd35296463de889d2ef9ace1fd.fagerland"}]}}}},{"node":{"data":{"title":"Et halvt år i en Principal Engineers liv","userIds":"Rune Storløpa","email":"rst@knowit.no","description":"Jeg har vært ute på oppdrag det siste halve året, og forsøkt å fortelle en kunde hvorfor utviklerne virker å være så ineffektive og hva de kan gjøre med det... Det fungerte sånn passe, så det tenkte jeg å fortelle om...","type":"talk","start":"15:30","end":"15:45","date":"19","duration":15,"room":"Grazia","speaker_bio":"Erfaren Principal Engineer, virksomhetsarkitekt, teknisk arkitekt / løsningsansvarlig, som aldri blir enig med seg selv om det er morsomst å lage gode løsninger eller å diskutere med beslutningstakere for å få de til å velge gode løsninger. Gjør derfor gjerne begge deler så langt tiden strekker til.\n\nRune har kjernekompetanse innenfor analyse, arkitektur og utvikling primært på Open Source-plattform i større enterprise systemer. Interessene har i senere tid også dreid i retning av å inkludere hele livsløpet til løsninger, og hvordan driftbarhet, videreutvikling, organisering og forvaltning av løsninger må tas inn i utviklingsprosessen for å kunne levere best mulige tjenester. Dette innebærer både rene tekniske aspekter, populært kalt DevOps. Men også mer organisatoriske, hvordan nye tekniske løsninger og forvaltning av disse får innvirkning på både budsjettprosesser og eksisterende arbeidsoppgaver for å kunne realisere gevinster i størst mulig grad.\n\nI rollen som Principal Engineer i Knowit Objectnet bidrar han også med rekruttering, kunnskapsutveksling, sikring av oppdrag etc. Han har også ledererfaring som teamleder og prosjektleder.","speaker_favourites":null,"speaker_recreation":null,"speaker_image":null}}},{"node":{"data":{"title":"Et historisk og forhåpentligvis underholdende tilbakeblikk på 20 års Objectnet-historie","userIds":"Birgitte og EirikV med flere","email":"lin@knowit.no","description":"Birgitte og Eirik V. drar med seg kjente og kjære Objectnet-fjes på et historisk – og forhåpentligvis underholdende – tilbakeblikk på 20 års Objectnet-historie. Det blir sofaprat, sang og musikk samt morsomme overraskelser. Ta på middagsantrekket og finn deg en god plass! Dette vil du ikke gå glipp av.","type":"keynote","start":"17:30","end":"18:30","date":"19","duration":60,"room":"BCD","speaker_bio":"\n","speaker_favourites":";;;;","speaker_recreation":null,"speaker_image":null}}},{"node":{"data":{"title":"Masteroppgave - Arkitektur for nye applikasjoner og tjenester i smarte byer, nabolag og hjem","userIds":"Petter Rostrup","email":"petter.rostrup@knowit.no","description":"Presentasjon om nøkkelpunktene fra masteroppgaven med tittel: \"A Distributed-to-Centralized Architectural Model for Smart City Applications and Services through Container Orchestration\". Den går gjennom behovene for utviklingen av nye applikasjoner og tjenester til bruk i smarte byer, nabolag og hjem. Fokuset ligger på hvordan noen av de voksende utfordringene i smarte byer kan håndteres/reduseres fra et utviklingsperspektiv.","type":"talk","start":"13:00","end":"13:30","date":"19","duration":30,"room":"Grazia","speaker_bio":"Petter er systemkonsulent / utvikler med Master i Informatikk fra NTNU. Han har spesialisering innen programvaresystemer, og er en engasjert og sosial person som er glad i nye utfordringer. Han trives godt som fullstack-utvikler der det ikke trenger å være noen begrensninger i typen arbeidsoppgaver. Han har erfaring med mange teknologier, og har utviklet sluttprodukter til varierende formål. Han synes det er spennende å jobbe med  funksjonalitet fra konsept til produksjonsklar kode. Petter er faglig nysgjerrig på nye teknologier og rammeverk,","speaker_favourites":null,"speaker_recreation":null,"speaker_image":null}}},{"node":{"data":{"title":"Prosessering av industrielle IoT datastrømmer","userIds":"Christian Egeberg","email":"ceg@knowit.no","description":"Om hvordan å håndtere mengder av strømmende måleverdier til mer enn bare trivielle grenseverdivarslinger. Litt om arkitektur, mellomlagring, prekalkulering, aggregering, ytelse og skalering, basert på praktiske erfaringer opparbeidet de siste par årene.","type":"talk","start":"13:00","end":"13:30","date":"19","duration":30,"room":"Harmoni","speaker_bio":"Christian er egentlig en idealistisk gammel nerd, som tror han kan slippe unna presset om å styre prosjekter, eller ta lederansvar, ved å grokke aspekter av skyarkitektur og data engineering. Fallback planen er basert på håpet om at optimalisering av sql spørringer og relasjonsdatabaser en dag skal bli like mye verdt som de andre gamlingene som programmerer cobol for finansielle institusjoner. Dream on, and get off my lawn...","speaker_favourites":"sjokolade;prog metal;Senja;Fifth element;Emanuel Vigelands mausoleum","speaker_recreation":"sover","speaker_image":{"localFiles":[]}}}},{"node":{"data":{"title":"Borre hull i autonome siloer","userIds":"Steinar Brunvoll Hanssen","email":"sbh@knowit.no","description":"Mange i Knowit Objectnet jobber eller har jobbet i kryss-funksjonelle team. De siste par årene har flere av teamene i tillegg fått merkelappen autonome / selvorganiserende med større grad av frihet i teamhverdagen. Det har vært en en reise med litt blandede erfaringer. For eksempel har samhandling på tvers av team og ut mot andre interessenter blitt påvirket negativt. Satt litt på spissen så kan det være like vanskelig å gå i takt med interne autonome team som 3dje-partsleverandører. Og det er vel ikke helt der vi ønsker å ende opp?","type":"talk","start":"15:15","end":"15:45","date":"19","duration":15,"room":"Harmoni","speaker_bio":"Deltar på veterantreff i Knowit Objectnet. Så det betyr at jeg har vært i sjappa i noen år. Har som regel mange hatter på i prosjektene jeg er i (teamlead, funksjonell arkitekt, testleder/tester, ++) og trives godt i større prosjekter.","speaker_favourites":";Mange;Destinasjoner med ski og fotball;Mange;Romsdalen","speaker_recreation":"Ser Molde og Liverpool vinne titler","speaker_image":{"localFiles":[]}}}},{"node":{"data":{"title":"Middag","userIds":null,"email":null,"description":"Middag på Mlynec, La Republica, La casa Argentina og Marina","type":"other","start":"19:30","end":null,"date":"20","duration":null,"room":null,"speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null,"speaker_image":null}}},{"node":{"data":{"title":"Open Space","userIds":null,"email":null,"description":null,"type":"talk","start":"16:00","end":"16:30","date":"19","duration":30,"room":"Idea","speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null,"speaker_image":null}}},{"node":{"data":{"title":"Medisinsk simulering som et distribuert system","userIds":"Aleksander Pettersen","email":"aleksander.pettersen@knowit.no","description":"Laerdal Medical har de siste femten årene basert mye av simuleringen sin på noen få applikasjoner. Disse monolittene skulle dekke hvert sitt domene men har over tid utviklet seg til å prøve å favne over alle simuleringsdomener - med overlapping av hverandre. LM ønsket en fleksibel arkitektur som tillater rask prototyping samt klinisk nøyaktighet - dette arbeidet er påbegynt.","type":"talk","start":"13:45","end":"14:15","date":"19","duration":30,"room":"Harmoni","speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null,"speaker_image":null}}},{"node":{"data":{"title":"En fiberoptisk reise","userIds":"Espen Tjønneland","email":"etj@knowit.no","description":"Vi har 64.000 kilometer med fiberoptisk kabel, jeg forteller hva vi gjør med den, og hvordan vi gjør det.","type":"talk","start":"14:00","end":"14:15","date":"19","duration":15,"room":"C","speaker_bio":"Halvgammel systemutvikler/arkitekt som for tiden jobber med å fylle opp statskassa gjennom Equinor. Vært med siden 2001 da jeg begynte i Genera (som ble til Unified, som ble til Objectnet, som ble til Knowit).","speaker_favourites":"Asiatisk, gjerne Thai.;Veldig allsidig;Australia;Alt som er Sci-Fi;Reffen i København.","speaker_recreation":"Leverer barn på fritidsaktiviteter, og en gang i blant brygger øl.","speaker_image":null}}},{"node":{"data":{"title":"Andre fly til Praha (Norwegian) - DY1504","userIds":null,"email":null,"description":"NORWEGIAN - DY1504","type":"other","start":"19:25","end":"21:25","date":"18","duration":null,"room":null,"speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null,"speaker_image":null}}},{"node":{"data":{"title":"Svelte: Det raske rammeverket uten VDOM ","userIds":"Eirik Vågeskar","email":"eirik.vageskar@knowit.no","description":"Én ting kan stoppe Svelte i å bli noe stort: At React og Vue lærer av det, og det litt kvikt. For hvilken Javascript-utvikler har ikke lyst på bittesmå bundles, rask ytelse og kort utviklingstid? Dette foredraget presenterer Svelte og hvordan det brukes hos Entur sammen med React. \n\nEirik Vågeskar har lekt med Svelte i noen måneder. På den tiden har han rukket å stifte Svelte-guild, å bidra til Svelte på Github og å ta i bruk Svelte på prosjekt i Entur. Til tross for åpenbar partiskhet, lover han å gi en nøktern fremstilling av fordeler og ulemper i foredraget. ","type":"talk","start":"13:45","end":"14:15","date":"19","duration":30,"room":"D","speaker_bio":"Eirik har vært ansatt i Knowit Objectnet siden høsten 2017. Før dette tok han en utdanning som sivilingeniør i datateknologi ved NTNU i Trondheim, der han spesialiserte seg innen kunstig intelligens.  \n\nSiden ansettelsen har han jobbet som frontend-utvikler. Han bruker også mesteparten av fagtiden på det, som medlem av faggruppene for frontend-utvikling og for brukeropplevelse. Han er en ihuga tilhenger av «clean code», og er opptatt av å skrive kode som er pålitelig, rask og lettlest. \n\nHan er glad i å jobbe med oppgaver som krever mye tenking. Ved kontorpulten jobber han helst i stillhet. I pauser såvel som etter arbeidstid liker han å prate.","speaker_favourites":null,"speaker_recreation":null,"speaker_image":null}}},{"node":{"data":{"title":"Funksjonelle programmerings-konsepter forklart med dårlige metaforer og stygge tegninger.","userIds":"Tale Prestmo","email":"tale.prestmo@knowit.no","description":"\nSynes du at ord som \"monad\", \"functor\", \"function composition\" (I could go on forever), eller rett of slett bare \"funksjonell programmering\" er litt vanskelig å forstå? Ønsker du flere knagger å henge konseptene på? Kom til en litt utradisjonell presentasjon, der et utvalg av disse blir forklart med dårlige metaforer, akkompagnert av stygge tegninger som jeg har laga helt sjæl.","type":"talk","start":"15:15","end":"15:30","date":"19","duration":15,"room":"D","speaker_bio":null,"speaker_favourites":"Siden jeg spiser det så sjeldent og det er høst nå: kanskje lammeskank med potetmos og rotgrønnsaker.;Er en av de kjipe som stort sett hører på det som er på topplista.;Nye plasser jeg enda ikke har vært.;Big Hero 6;Huset til mams og paps i Spania","speaker_recreation":"Det varierer, men det går bla. i puslespill, lese bøker, se tv-serier, være med venner osv. ","speaker_image":{"localFiles":[{"publicURL":"/static/tale-8b9459818c2a16b17844b3ba362d89a9.prestmo"}]}}}},{"node":{"data":{"title":"Fritid","userIds":null,"email":null,"description":null,"type":"other","start":"13:00","end":"18:30","date":"20","duration":null,"room":null,"speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null,"speaker_image":null}}},{"node":{"data":{"title":"Pause","userIds":null,"email":null,"description":null,"type":"other","start":"14:15","end":"14:30","date":"19","duration":null,"room":null,"speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null,"speaker_image":null}}},{"node":{"data":{"title":"Lunsj","userIds":null,"email":null,"description":null,"type":"other","start":"12:00","end":"13:00","date":"19","duration":null,"room":null,"speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null,"speaker_image":null}}},{"node":{"data":{"title":"Transfer til flyplass","userIds":null,"email":null,"description":null,"type":"other","start":"14:15","end":null,"date":"21","duration":null,"room":null,"speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null,"speaker_image":null}}},{"node":{"data":{"title":"Genus","userIds":"René Raisanen","email":"rene.raisanen@knowit.no","description":null,"type":"talk","start":"13:45","end":"14:15","date":"19","duration":30,"room":"B","speaker_bio":"Gjennom sine erfaringer med kunder og gjester i andre bransjer har René bygget seg opp en god evne til å avdekke nødvendige behov og finne gode løsninger til disse. I årene før han ble ansatt lå fokuset på å benytte JavaScript og tilhørende rammeverk, blant annet Node.js og Vue.js, til å bygge enkle, men effektive brukergrensesnitt og verktøy. \r\n\r\nI sitt første prosjekt for Knowit ble han satt til å jobbe backend med et stort sammensatt prosjekt hvor han viste initiativ til å sette seg inn i og lære hvordan både teknologiene og prosjektet fungerte. Det tok ikke lang tid før han var produktiv selv med mange teknologier som han tidligere ikke var kjent med.","speaker_favourites":null,"speaker_recreation":null,"speaker_image":null}}},{"node":{"data":{"title":"Slå knockout på knockout med Vue","userIds":"Henning Lund-Hanssen","email":"henning.lund-hanssen@knowit.no","description":"På ORIGO hos Oslo Kommune har vi kastet ut knockout og kjører all-in med Vue. Dette er en erfaringsfortelling fra team Min side om hvordan ting så ut, hva vi så for oss og hva vi har endt opp med. På godt og vondt - mest godt ;)","type":"talk","start":"14:45","end":"15:00","date":"19","duration":15,"room":"D","speaker_bio":"Alt-mulig-mann som digger å rydde etter en fest!","speaker_favourites":"Pasta, pesto og kylling <3;FOR HEAVY METAL WE WILL DIE!;Balkan;Supervention og Band of Brothers;Står mellom Stavkroa og kjellern på Sandaker senter","speaker_recreation":"Trener, musikererer og gamer","speaker_image":{"localFiles":[{"publicURL":"/static/henning-10d73a2d92560e968b89c7e1997993a7.lund-hanssen"}]}}}},{"node":{"data":{"title":"Pause","userIds":null,"email":null,"description":null,"type":"other","start":"09:30","end":"09:45","date":"20","duration":null,"room":null,"speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null,"speaker_image":null}}},{"node":{"data":{"title":"Pause","userIds":null,"email":null,"description":null,"type":"other","start":"10:10","end":"10:25","date":"19","duration":null,"room":null,"speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null,"speaker_image":null}}},{"node":{"data":{"title":"Brettspill","userIds":null,"email":null,"description":"Vi prøver oss på en spillkveld som alternativ til fest på byen. Vi stiller med spillene: Citadels, Codenames, Coup, Lords of Waterdeep, Hanabi, Pandemic og Azul. Møt opp etter middag (ta en taxi tilbake til hotellet), for avslappet stemning med snacks og drikke og litt brettspill.","type":"other","start":"22:00","end":null,"date":"20","duration":null,"room":"Cafe Bistro","speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null,"speaker_image":null}}},{"node":{"data":{"title":"Pause","userIds":null,"email":null,"description":null,"type":"other","start":"11:15","end":"11:30","date":"20","duration":null,"room":null,"speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null,"speaker_image":null}}},{"node":{"data":{"title":"Open Space","userIds":null,"email":null,"description":null,"type":"talk","start":"16:00","end":"16:30","date":"19","duration":30,"room":"D","speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null,"speaker_image":null}}},{"node":{"data":{"title":"How do I quantum?","userIds":"Erik Lund","email":"erik.lund@knowit.no","description":"Enkel innføring i bruk av simulerte kvantemaskiner på JVM. Begreper rundt kvantemaskiner, hvorfor de kommer og hvordan kode ser ut for nybegynnere. ","type":"talk","start":"13:45","end":"14:00","date":"19","duration":15,"room":"C","speaker_bio":null,"speaker_favourites":";;;;En hyggelig brun pub for å diskutere verdensproblemer og løse dem.","speaker_recreation":null,"speaker_image":{"localFiles":[{"publicURL":"/static/erik-35cdd52c772cc1f413c01dfb2dc810d0.lund"}]}}}},{"node":{"data":{"title":"Middag","userIds":null,"email":null,"description":"Middag i mindre grupper","type":"other","start":"20:00","end":null,"date":"19","duration":null,"room":null,"speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null,"speaker_image":null}}},{"node":{"data":{"title":"Open Space","userIds":null,"email":null,"description":null,"type":"talk","start":"15:15","end":"15:45","date":"19","duration":30,"room":"Idea","speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null,"speaker_image":null}}},{"node":{"data":{"title":"Open Space","userIds":null,"email":null,"description":null,"type":"talk","start":"16:00","end":"16:30","date":"19","duration":30,"room":"Harmoni","speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null,"speaker_image":null}}},{"node":{"data":{"title":"Pause","userIds":null,"email":null,"description":null,"type":"other","start":"15:00","end":"15:15","date":"19","duration":null,"room":null,"speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null,"speaker_image":null}}},{"node":{"data":{"title":"Lunsj","userIds":null,"email":null,"description":null,"type":"other","start":"12:00","end":"13:00","date":"20","duration":null,"room":null,"speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null,"speaker_image":null}}},{"node":{"data":{"title":"Mobbing på arbeidsplassen","userIds":"Geir Nohre-Solvang","email":"geirhs@knowit.no","description":"Mobbing forekommer i alle livets faser. Mennesker har forskjellige syn og oppfatninger av hva som er mobbing, og hva man bør kunne akseptere i et miljø. \nI dette foredraget deler jeg mine erfaringer og opplevelser rundt temaet mobbing. Fra det å lede et minerydde team i utlandet, via å lede en tippeligaklubb med 11 nasjonaliteter til i dag å holde styr på noen utviklere og designere. Mobbing og personlighet, mobbing og arbeidsmiljø, mobbing og ledelse er noen av stikkordene i foredraget.","type":"keynote","start":"09:45","end":"10:15","date":"20","duration":30,"room":"BCD","speaker_bio":null,"speaker_favourites":";;;;","speaker_recreation":null,"speaker_image":null}}},{"node":{"data":{"title":"Aktiviteter","userIds":null,"email":null,"description":"Aktiviteter eller fritid med egen lunsj. Informasjon for hver aktivitet finner du på confluence. Her kan du også hvilken aktivitet du er påmeldt.","type":"other","start":"08:00","end":"14:30","date":"21","duration":null,"room":null,"speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null,"speaker_image":null}}},{"node":{"data":{"title":"Open Space","userIds":null,"email":null,"description":null,"type":"talk","start":"13:45","end":"14:15","date":"19","duration":30,"room":"Idea","speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null,"speaker_image":null}}},{"node":{"data":{"title":"Brettspill","userIds":null,"email":null,"description":"Vi prøver oss på en spillkveld som alternativ til fest på byen. Vi stiller med spillene: Citadels, Codenames, Coup, Lords of Waterdeep, Hanabi, Pandemic og Azul. Møt opp etter middag (ta en taxi tilbake til hotellet), for avslappet stemning med snacks og drikke og litt brettspill.","type":"other","start":"22:00","end":null,"date":"19","duration":null,"room":"Cafe Bistro","speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null,"speaker_image":null}}},{"node":{"data":{"title":"Frokost","userIds":null,"email":null,"description":null,"type":"other","start":"06:30","end":"09:00","date":"19","duration":null,"room":null,"speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null,"speaker_image":null}}},{"node":{"data":{"title":"En mer produktiv arbeidsdag med bedre møter!","userIds":"Viktoria Stray","email":"stray@ifi.uio.no","description":"Viktoria Stray fra SINTEF, kjent i Norge som “Dr. Smidig”, gir oss innblikk i smidig forskning og tips for en bedre møtehverdag.\n\nHva kan vi gjøre for å få det beste ut av møtene i prosjektene våre? Alle er i møter og har en mening om møter, men hva sier forskning om møter? Gjennom å studere bedrifter som gjennomfører digitaliseringsprosjekter, har Viktoria fått innsikt i møtene til alt fra finansfolk til byråkrater.\n\nEt godt møte bør være nyttig for bedriften, gjøre de ansatte bedre rustet til å jobbe sammen og oppleves som meningsfylt for møtedeltagerne der og da.\n\n\nDu får Viktorias beste tips, og inspirasjon til å holde produktive og gode møter.\n\nDr. Smidig: https://www.dataforeningen.no/dr-smidigs-standup-diagnose-endret-norge/","type":"keynote","start":"10:25","end":"11:10","date":"19","duration":45,"room":"BCD","speaker_bio":"Viktoria Stray er møteforsker og ekspert på smidige arbeidsformer. Hun jobber som førsteamanuensis på Universitetet i Oslo og forsker på SINTEF.\n\n\nVi kjenner henne fra Knowits forskningssamarbeid, dessuten bidrar hun til Knowit Academy med en sesjon på utviklingsprosesser.\nHun er utdannet sivilingeniør i datateknikk fra NTNU og hun har en PhD i software engineering fra universitetet i Oslo. Stray har også flere års industrierfaring som IT-konsulent i Accenture. Hun jobber tett med bedrifter innen finans og IT.\n\nhttps://www.linkedin.com/in/viktoriastray/","speaker_favourites":"Sushi;Popmusikk;Nye steder;Black Mirror;","speaker_recreation":"Trener (aller helst step-timer på Sats), koser meg med familien, skravler med venninner og leser bøker.","speaker_image":{"localFiles":[{"publicURL":"/static/viktoria-ce0794584c444d92c29d6bcedafcb0af.jpg"}]}}}},{"node":{"data":{"title":"Pause","userIds":null,"email":null,"description":null,"type":"other","start":"15:45","end":"16:00","date":"19","duration":null,"room":null,"speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null,"speaker_image":null}}},{"node":{"data":{"title":"Open Space","userIds":null,"email":null,"description":null,"type":"talk","start":"16:00","end":"16:30","date":"19","duration":30,"room":"B","speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null,"speaker_image":null}}},{"node":{"data":{"title":"Mikrotjeneste med Spring; fra Java til Kotlin","userIds":"Frode Ånonsen","email":"froano@knowit.no","description":"Eksempel på å migrere en enkel Spring Boot basert mikrotjeneste fra Java til Kotlin.\nPain points, lessons, etc.\n\n* Sette context, vise oversikt over tjeneste, kjøremiljø\n* Se gjennom kode, byggescript\n* Refaktorere til Kotlin, forenkle. Teste.\n* Refaktorere bygg til KotlinScript. Demonstrere Gradle/KTS med intellisense. Teste.\n* Bygge\n* Oppsummering","type":"talk","start":"13:00","end":"13:15","date":"19","duration":15,"room":"C","speaker_bio":"Frode Ånonsen er en erfaren utvikler. Frode har bakgrunn fra IT-design og -ariktektur, samt applikasjonsutvikling. Han skriver kode i høy kvalitet basert på de anerkjente SOLID prinsippene, hvor han benytter hensiktsmessige designmønstre.\r\nFrode er en erfaren full-stack utvikler og en entusiastisk og pålitelig konsulent, og er et positivt tilskudd til et team.\r\nVidere har han erfaring med smidige utviklingsmetodikker som Scrum og Kanban og test-drevet utvikling. Han har over 20 års erfaring med blant annet Javascript, Scala, Clojure, Java, C#/.Net og andre teknologier.\r\nHan kjenner godt til åpne teknologier som Linux, Apache, Nginx, Mysql, Postgresql, Neo4j, Datomic, Docker, Kubernetes, Openshift osv.\r\n\r\nFrode er også fagansvarlig i Knowit Stavanger.","speaker_favourites":null,"speaker_recreation":null,"speaker_image":null}}},{"node":{"data":{"title":"Open Space","userIds":null,"email":null,"description":null,"type":"talk","start":"16:00","end":"16:30","date":"19","duration":30,"room":"Grazia","speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null,"speaker_image":null}}},{"node":{"data":{"title":"Hvordan brukes AI i industri?","userIds":"Eirik Folkestad","email":"eirik.folkestad@knowit.no","description":"World Summit AI i Amsterdam 9-10 oktober 2019 er en ledende konferanse innen AI som samler akademia og industri under et tak. Konferansen har da et spesielt fokus på AI i industri og har et program bestående av talks fra bedrifter som Facebook, Google og Alibaba for å nevne noen. Denne talken vil være en videreformidling av lærdom/erfaringer/idéer tilegnet fra talkene holdt under denne konferansen.","type":"talk","start":"13:00","end":"13:15","date":"19","duration":15,"room":"Idea","speaker_bio":"Master i Datateknologi fra NTNU med faglig tillegg i maskinlæring ved Auckland University of Technology og University of Melbourne. Jobber som full-stack utvikler med Javascript-baserte rammeverk som React, Node og Java-rammeverk som Spring. Har også tidligere erfaring med Python og funksjonelle språk som Haskell. Eirik har fordypet seg i maskinlæring i sin mastergrad og har vært med på å utvikle et system som tar i bruk maskinlæringsmetoder for å klassifisere banktransaksjoner til kategorier basert på deres tekstlige beskrivelse.","speaker_favourites":null,"speaker_recreation":null,"speaker_image":null}}},{"node":{"data":{"title":"Brettspill","userIds":null,"email":null,"description":"Vi prøver oss på en spillkveld som alternativ til fest på byen. Vi stiller med spillene: Citadels, Codenames, Coup, Lords of Waterdeep, Hanabi, Pandemic og Azul. Møt opp etter middag (ta en taxi tilbake til hotellet), for avslappet stemning med snacks og drikke og litt brettspill.","type":"other","start":"22:30","end":null,"date":"18","duration":null,"room":"Cafe Bistro","speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null,"speaker_image":null}}},{"node":{"data":{"title":"Middag","userIds":null,"email":null,"description":"Middag på La pasta fresca","type":"other","start":"20:00","end":null,"date":"20","duration":null,"room":null,"speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null,"speaker_image":null}}},{"node":{"data":{"title":"Bartenderskole","userIds":null,"email":null,"description":null,"type":null,"start":"09:00","end":null,"date":"21","duration":null,"room":null,"speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null,"speaker_image":null}}},{"node":{"data":{"title":"Guidet byvandring 4 timer","userIds":null,"email":null,"description":null,"type":"other","start":"08:30","end":"12:30","date":"21","duration":120,"room":null,"speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null,"speaker_image":null}}},{"node":{"data":{"title":"Sykkeltur","userIds":null,"email":null,"description":null,"type":null,"start":"09:30","end":null,"date":"21","duration":null,"room":null,"speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null,"speaker_image":null}}},{"node":{"data":{"title":"Avreise Melnik","userIds":null,"email":null,"description":"Direkte til flyplass etter endt aktivitet i Melnik","type":null,"start":"08:00","end":null,"date":"21","duration":null,"room":null,"speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null,"speaker_image":null}}},{"node":{"data":{"title":"Seneste utsjekk","userIds":null,"email":null,"description":null,"type":null,"start":"11:00","end":null,"date":"21","duration":null,"room":null,"speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null,"speaker_image":null}}},{"node":{"data":{"title":"Praha Beer Museum","userIds":null,"email":null,"description":null,"type":null,"start":"11:00","end":null,"date":"21","duration":null,"room":null,"speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null,"speaker_image":null}}},{"node":{"data":{"title":"Guidet byvandring 2 timer","userIds":null,"email":null,"description":null,"type":null,"start":"09:00","end":"11:00","date":"21","duration":null,"room":null,"speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null,"speaker_image":null}}},{"node":{"data":{"title":"Open Space Koordinering ","userIds":"Anders R. Dahlen","email":"anders.dahlen@knowit.no","description":"En selvorganiserende konferanseform. Vi lager agenda sammen. Detaljer, les beskrivelse <a href=\"https://en.wikipedia.org/wiki/Open_Space_Technology\" target=\"_blank\"  rel=\"noopener\">her</a>. For en oversikt over innkommende forslag se: <a href=\"https://docs.google.com/spreadsheets/d/18eCB9uHwp4T_lAeZZK0mhlmEtMGm39NdlzLQZzlTxUI/edit#gid=0\" target=\"_blank\"  rel=\"noopener\">her</a>. ","type":"keynote","start":"11:45","end":"12:00","date":"19","duration":15,"room":null,"speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null,"speaker_image":null}}},{"node":{"data":{"title":"Pause","userIds":null,"email":null,"description":null,"type":"other","start":"11:10","end":"11:25","date":"19","duration":null,"room":null,"speaker_bio":null,"speaker_favourites":null,"speaker_recreation":null,"speaker_image":null}}}]}}}